[
  {
    "stampnumber": "001",
    "nameen": "Nemuro Peninsula Chashi Site",
    "namejp": "根室半島チャシ跡群",
    "castlepic": "/images/castlepics/castle001.png",
    "stamppic": "/images/stamps/stamp001.png",
    "region": "Hokkaido",
    "prefecture": "Hokkaido",
    "city": "Nemuro",
    "type": "Flatland",
    "condition": "Ruins only",
    "access": "JR train to Nemuro and rental car; or 150 minutes drive from Kushiro airport or Nakashibetu airport.",
    "website": "https://www.nemuro-kankou.com/tourism/ainuchashi/",
    "history": "Nemuro Hanto Chashi Ato Gun is a group of forts (Chashi) spread along north shore of Nemuro peninsula and is the 1st “castle” in the 100 Meijo book. Nemuro Peninsula is a long, narrow peninsula in the far eastern part of Hokkaido and it is believed that these forts were built in the 16th to 18th century, but the purpose is not completely clear. The forts were primarily built at the edge of cliffs along the Okhotsk Sea. There are 24 sites that are collectively registered as a national historic site and are shown on a map in the 100 Meijo book; however, most are inaccessible and hard to locate. There are two locations along Route 35 on the northern coast that have a sign and a small parking lot. There are no remaining structures and only circular grass-covered mounds where there were once clay walls and dry moats."
  },
  {
    "stampnumber": "002",
    "nameen": "Goryokaku Fort",
    "namejp": "五稜郭",
    "castlepic": "/images/castlepics/castle002.png",
    "stamppic": "/images/stamps/stamp002.png",
    "region": "Hokkaido",
    "prefecture": "Hokkaido",
    "city": "Hakodate",
    "type": "Flatland",
    "condition": "No main keep but other buildings",
    "access": "Bus or streetcar from Hakodate station",
    "website": "http://www.hakodate.or.jp/guide/modules/map/index.php?lid=721&cid=41",
    "history": "If you look at this picture and the next one you should be able to see that this fort has a star shape. The Tokugawa shogunate began construction of this castle in 1857 and completed it in 1864. This was the first Western (specifically, Vauban) style fortress in Japan. This style was also popular in Europe at the time for it's ability to withstand damage from modern weapons.\n\nAfter Japan was forced to open up trading with other countries by the US, the Tokugawa Shogunate opened ports in Hakodate and Shimoda. This fort at Hakodate was designed to defend the city from any Northern threats. Upon completion a government office was established inside which controlled all of Hokkaido.\n\nDuring the Boshin War (1867-1869) rebel Shogunate forces battled with the Imperial forces after the return of power to the Emperor. The Shogunate forces eventually retreated to Hakodate where they took control of Goryokaku and the Hakodate War began. A year later the last of the rebels surrendered to Imperial forces, thus concluding the last remnant of Feudal Japan."
  },
  {
    "stampnumber": "003",
    "nameen": "Matsumae Castle",
    "namejp": "松前城",
    "castlepic": "/images/castlepics/castle003.png",
    "stamppic": "/images/stamps/stamp003.png",
    "region": "Hokkaido",
    "prefecture": "Hokkaido",
    "city": "Matsumae",
    "type": "Flatland",
    "condition": "Reconstructed main keep",
    "website": "http://www.asobube.com/database.cgi?dbnum=8&dbkonum=0",
    "history": "In 1849 the The Tokugawa government commanded Matsumae Takahiro to build a castle to enhance the defenses of the area. It was completed in 1854. The location of Matsumae Castle on the Southwesternmost tip of Hokkaido was a vital point for controlling the passage between Hokkaido and Honshu. At the time, the Matsumae did not have the funds to build a new castle at Mt. Hakodate, the recommended site, so they decided to fortify the home of Matsumae Takahiro at Fukuyama instead.\n\nDuring the Boshin War in 1868, the remnants of the Tokugawa Government that took control of Goryokaku in Hakodate also attacked and defeated Matsumae Castle.\n\nIn 1941, the main keep was designated a National Treasure, but it burned down in a fire that spread from the town hall in 1949. It was rebuilt in 1959. Matsumae Castle is considered to be the last of the traditional Japanese castles."
  },
  {
    "stampnumber": "004",
    "nameen": "Hirosaki Castle",
    "namejp": "弘前城",
    "castlepic": "/images/castlepics/castle004.png",
    "stamppic": "/images/stamps/stamp004.png",
    "region": "Tohoku",
    "prefecture": "Aomori",
    "city": "Hirosaki",
    "type": "Hilltop",
    "condition": "Original main keep",
    "access": "Hirosaki Station, 25 minute walk, or short bus ride",
    "website": "http://www.city.hirosaki.aomori.jp/hirosaki400th/index.html",
    "history": "Ooura Tamenobu was awarded the area around Hirosaki for his loyalty to Hideyoshi during the Battle of Odawara. He changed his name to to Tsugaru and started work on Hirosaki Castle in 1603. He died in 1607 and work on the castle was put on hold until his son Tsugaru Nobuhira restarted it in 1610. He finished the castle in just one year by cannibalizing materials from Horikoshi Castle and Daikoji Castle. The 3 level main keep of Hirosaki Castle seems disproportionately small when compared to the huge estate encompassed by the castle today. Hirosaki Castle was originally built with a 5 level keep which was struck by lightning and burned to the ground in 1627. The new 3 level keep is actually just the renovated Ninomaru tasumi yagura watchtower. The Tsugaru clan held the castle until the Meiji Restoration when it was taken over by the government.\n\nHirosaki Castle has the only extant main keep to the east of Matsumoto Castle (Nagano Pref.) making it a historical treasure of the Tohoku region. Hirosaki Castle is also famous throughout Japan for the more than 2600 cherry trees that fill its grounds today. Every spring when the trees are in bloom thousands of visitors flock to the grounds for one of Japan's finest Cherry Blossom Festivals."
  },
  {
    "stampnumber": "005",
    "nameen": "Ne Castle",
    "namejp": "根城",
    "castlepic": "/images/castlepics/castle005.png",
    "stamppic": "/images/stamps/stamp005.png",
    "region": "Tohoku",
    "prefecture": "Aomori",
    "city": "Hachinohe",
    "type": "Flatland",
    "condition": "No main keep but other buildings",
    "access": "Hachinohe Sta. (Tohoku Main Line), 15 min bus, 5 min walk",
    "website": "http://www.hachinohe.ed.jp/haku/hiroba.html",
    "history": "Moroyuki Nanbu built Ne Castle in 1334 during the period known as the Northern & Southern Courts Period. Under allegiance to the Southern Court, Nanbu established Ne Castle to become the center of imperial government in the area. Another branch of the same Nanbu family actually ruled the Sannohe and Morioka area for the Northern Court at the same time. In 1393 at the end of this Northern & Southen Courts period, the 2 families also made peace with each other. During the Sengoku Period, the 18th generation Nanbu (Masayuki Nanbu) was a daimyo loyal to Toyotomi HIdeyoshi. After the Battle of Odawara, Masayuki was made a retainer of Nobunao Nanbu from Sannohe. In 1627, Nanbu Naoyoshi was moved to Tohno (Iwate Pref.) and the Nanbu lord from Sannohe moved to Hachinohe where he established a new castle, Hachinohe Castle, to the East of Ne Castle closer to the ocean."
  },
  {
    "stampnumber": "006",
    "nameen": "Morioka Castle",
    "namejp": "盛岡城",
    "castlepic": "/images/castlepics/castle006.png",
    "stamppic": "/images/stamps/stamp006.png",
    "region": "Tohoku",
    "prefecture": "Iwate",
    "city": "Morioka",
    "type": "Hilltop",
    "condition": "Ruins only",
    "access": "Morioka Station (Tohoku Honsen), 15 minute walk",
    "website": "http://www.city.morioka.iwate.jp/shisei/midori/koen/1010491.html",
    "history": "Nanbu Nobunao, lord of Sannohe Castle was awarded lands around Morioka for his loyalty to Toyotomi Hideyoshi. He founded Morioka Castle in 1598 to better control the important riverways of the Kitakami and Nakatsu rivers. Unfortunately, Nobunao died before finishing construction. The castle was completed by his son Shigenao in 1633. The Nanbu family retained control over this castle for the entire Edo Period until the coming of the Meiji Restoration. Nanbu Nobunao also contributed to the construction of Hizen Nagoya Castle which may have influenced him to make such a vast stone walled castle. During the construction there were some problems with flooding and weak foundations of the castle site. You will see some smaller stone walled buttresses against some of the walls that seem to serve no purpose. They may have been built like that to further strengthen the walls."
  },
  {
    "stampnumber": "007",
    "nameen": "Taga Castle",
    "namejp": "多賀城",
    "castlepic": "/images/castlepics/castle007.png",
    "stamppic": "/images/stamps/stamp007.png",
    "region": "Tohoku",
    "prefecture": "Miyagi",
    "city": "Tagajo",
    "type": "Hilltop",
    "condition": "Ruins only",
    "access": "Kokufu-Tagajo Sta. (Tohoku Main Line), 15 min walk",
    "website": "http://tagakan.jp/",
    "history": "Taga Castle was built on the boundary between the Emishi people of the northeast and the lands ruled by the Imperial Court in Kyoto. It was the main military and political base for the pacification of the northeast. It was burned down in a rebellion in 780 but was soon rebuilt. Sakanoue no Tamuramaro moved the military base farther north in 802, but Taga Castle continued to flourish as the political and administrative center. Taga Castle lost it's importance during the period of Northern and Southern courts.\n\nSeveral castles of this same type were built pushing farther into the north as new territories were subjugated. Taga Castle is well known for being mentioned in an ancient history text (shokunihonki) and by Matsuo Basho in his famous Oku no Hosomichi."
  },
  {
    "stampnumber": "008",
    "nameen": "Sendai Castle",
    "namejp": "仙台城",
    "castlepic": "/images/castlepics/castle008.png",
    "stamppic": "/images/stamps/stamp008.png",
    "region": "Tohoku",
    "prefecture": "Miyagi",
    "city": "Sendai",
    "type": "Mountaintop",
    "condition": "No main keep but other buildings",
    "access": "Sendai Station (Tohoku main line), 15 minutes by bus",
    "website": "http://www.sendaijyo.com",
    "history": "Date Masamune received increased lands around Sendai for giving his support to Tokugawa in the Battle of Sekigahara. Sendai Castle never had a large main keep like many castles of this time period. There are various theories why and some proof that there were plans to build a large 5 story keep though it was never carried out. Even without a large main keep it was still an impressive castle with three 3 story yagura and a great honmaru palace. Date Tadamune added the Ninomaru after he became lord of Sendai.\n\nAfter the Boshin War, the honmaru was torn down. During a fire in 1882 most of the ninomaru was burned to the ground and the remaining buildings of the castle were destroyed during the bombings of WWII.\n\nDate Masamune is one of the most interesting figures of his time period. Known as the \"One Eyed Dragon\" (he lost the use of his right eye to smallpox), he was feared by Toyotomi Hideyoshi and later became a deputy Shogun in the Tokugawa regime. Masamune actively promoted culture and industry. He built the Osaki Hachiman Shrine in Sendai and the Zuiganji Temple in Matsushima. He organized improvements to the rivers, forests and transformed the Osaki plain into a fertile rice field. Masamune also built a ship and dispatched his own men including Hasekura Tsunenaga to the Pope in Rome. Masamune was one of the most intelligent daimyo of his time."
  },
  {
    "stampnumber": "009",
    "nameen": "Kubota Castle",
    "namejp": "久保田城",
    "castlepic": "/images/castlepics/castle009.png",
    "stamppic": "/images/stamps/stamp009.png",
    "region": "Tohoku",
    "prefecture": "Akita",
    "city": "Akita",
    "type": "Hilltop",
    "condition": "No main keep but other buildings",
    "access": "Akita Sta. (Oou Line); 10 min walk",
    "website": "https://www.city.akita.lg.jp/kanko/kanrenshisetsu/1002685/1009870/index.html",
    "history": "Satake Yoshinobu was moved from the Mito area to Akita in 1602 after the Battle of Sekigahara. He first moved into Minato Castle, but it was small with poor defenses so he built Kubota Castle in 1604. It's said that Satake never built a main keep nor any 3 level yagura so that he wouldn't attract the ire of the Tokugawa. Another theory is that he just couldn't afford an extravagant main keep. Even so, the castle had eight 2 story corner yagura and a large palace. Most of the buildings burned down in a fire in 1880. The Satake continued to rule until the Meiji Restoration."
  },
  {
    "stampnumber": "010",
    "nameen": "Yamagata Castle",
    "namejp": "山形城",
    "castlepic": "/images/castlepics/castle010.png",
    "stamppic": "/images/stamps/stamp010.png",
    "region": "Tohoku",
    "prefecture": "Yamagata",
    "city": "Yamagata",
    "type": "Flatland",
    "condition": "No main keep but other buildings",
    "access": "Yamagata Station (Yamagata Shinkansen), walk 15 mins",
    "website": "http://www.kankou.yamagata.yamagata.jp/",
    "history": "The castle originally established by Shiba Kaneyori at Yamagata is said to have been about the size of the honmaru of the later Yamagata castle. Shiba later took the name of the surrounding area and changed his name to Mogami. Mogami's ancestor Mogami Yoshiaki reconstructed the castle into a much larger fortress in 1592. He added the Ninomaru and Sannomaru baileys, but there was never a large main keep that you see at other castles. It did however have three 2 story and one 3 story yagura. While Mogami Yoshiaki went to the Battle of Sekigahara with Tokugawa Ieyasu, Uesugi Kagekatsu's general Naoe Kanetsugu went to attack Yamagata Castle but, supposedly, he could not find it in the thick fog. Thereafter, the castle was also known as kasumigajo, the castle in the haze.\n\nAt his peak after the battle of Sekigahara, Yoshiaki controlled land yielding 570,000 koku. Yoshiaki died in 1614 and his successor Iechika died shortly thereafter in 1617. His sucessor Yoshitoshi was reduced to 300,000 koku and later reassigned to Mikawa. The importance of Yamagata Castle to the Tokugawa rule over Eastern Japan declined over time, and with it the size of territory controlled by the lord of Yamagata Castle was also reduced."
  },
  {
    "stampnumber": "011",
    "nameen": "Nihonmatsu Castle",
    "namejp": "二本松城",
    "castlepic": "/images/castlepics/castle011.png",
    "stamppic": "/images/stamps/stamp011.png",
    "region": "Tohoku",
    "prefecture": "Fukushima",
    "city": "Nihonmatsu",
    "type": "Mountaintop",
    "condition": "No main keep but other buildings",
    "access": "Nihonmatsu Station (Tohoku Honsen), 15 minute walk",
    "website": "http://www.nihonmatsu-kanko.jp/kasumigazyo.html",
    "history": "The castle currently known as Kasumiga-jo (Nihonmatsu-jo) actually encompasses two different castles. At the top of the hill are the remnants of the original castle built by the Hatakeyama in the Muromachi period (1333-1573) somewhere between 1394-1427. The exact date is unknown. At the base of the hill are the remnants of the castle built by the Niwa clan. Each of these castles experienced its own separate demise.\n\nHatakeyama Yoshitsugu captured Date Terumune, Date Masamune 's father, in 1585 and tried to take him back to Nihonmatsu. Upon hearing this, Masamune, who was out hunting, took off on his horse and caught up with Hatakeyama Yoshitsugu near the Abukuma River. He and his men shot the whole party dead and Terumune was killed in the struggle.\n\nHearing of the weakness of Nihonmatsu, a group of samurai from Hitachi (Ibaraki prefecture), including men from the Satake, Ashina, Iwaki and Ishikawa clans, set out to take Nihonmatsu for themselves. They clashed with the Date forces near present day Motomiya (between Koriyama and Nihonmatsu). This was known as the battle of Hitotoribashi. The battle ended in a standstill and Kasumiga-jo stood independent from both forces.\n\nIn April of the following year (1586) Date Masamune's forces once again laid seige to Kasumiga-jo. In July the son of Hatakeyama Yoshitsugu set fire to the castle and fled to Aizu. Thus the original castle at Nihonmatsu met its interesting demise.\n\nThe second castle was then built at the base of the hill and controlled by various families loyal to the Date, with the Niwa clan controlling it from 1643 until the Meiji Restoration."
  },
  {
    "stampnumber": "012",
    "nameen": "Aizuwakamatsu Castle",
    "namejp": "会津若松城",
    "castlepic": "/images/castlepics/castle012.png",
    "stamppic": "/images/stamps/stamp012.png",
    "region": "Tohoku",
    "prefecture": "Fukushima",
    "city": "Aizuwakamatsu",
    "type": "Hilltop",
    "condition": "Reconstructed main keep",
    "access": "Wakamatsu Station (Ban'etsu Saisen), 30 minute walk or 10 minutes by bus",
    "website": "http://www.tsurugajo.com/~wakamatsujo/",
    "history": "Tsuruga-jo is the strongest and oldest fortress in all of Tohoku. It was originally built in 1384 as Kurokawa-jo by Ashina Naomori. In 1589 Date Masamune defeated Ashina Yoshihiro and moved into Kurokawa-jo. A year later it was absorbed by Toyotomi Hideyoshi and governed by Gamo Ujisato. Gamo renovated the castle and renamed it Tsuruga-jo. The reconstructed main keep you see today was built by Gamo.\n\nAfter the establishment of the Tokugawa Shogunate the castle was governed by the Matsudaira clan. The Matsudaira were a branch of the Tokugawa family and thus in the category of \"inner lords.\" The \"inner lords\" were branches of the Tokugawa family who kept watch over the daimyo who were not originally Tokugawa allies and provided a buffer between allied and non-allied daimyo.\n\nThe Matsudaira ruled from Tsuruga-jo until the Meiji Restoration when it fell in the Boshin War . The most famous episode from the downfall of Tsuruga-jo is that of the Byakkotai.\n\nThe layout, nawabari, of this castle was patterened after that of Osaka Castle during Hideyoshi's time."
  },
  {
    "stampnumber": "013",
    "nameen": "Shirakawa Castle",
    "namejp": "白河城",
    "castlepic": "/images/castlepics/castle013.png",
    "stamppic": "/images/stamps/stamp013.png",
    "region": "Tohoku",
    "prefecture": "Fukushima",
    "city": "Shirakawa",
    "type": "Hilltop",
    "condition": "Reconstructed main keep",
    "access": "Shirakawa Station (Tohoku Honsen), 7 minute walk",
    "website": "http://www.shirakawa.ne.jp/~kyokai/siro/",
    "history": "Komine-jo was originally built by the Yuuki in 1340. In 1627 it was taken over by Niwa Nagashige. Nagashige renovated the castle and renamed it Shirakawa-jo. At the beginning of the Edo period the castle was given to the Aizu Matsudaira by the Tokugawa government. The Matsudaira clan governed it until it fell during the Boshin War."
  },
  {
    "stampnumber": "014",
    "nameen": "Mito Castle",
    "namejp": "水戸城",
    "castlepic": "/images/castlepics/castle014.png",
    "stamppic": "/images/stamps/stamp014.png",
    "region": "Kanto",
    "prefecture": "Ibaraki",
    "city": "Mito",
    "type": "Hilltop",
    "condition": "No main keep but other buildings",
    "access": "Mito Sta. (Joban Line), 8 min. walk",
    "website": "https://mitokoumon.com/facility/historic/mitojoato/",
    "history": "Baba Sukemoto built the first castle on this site in 1214. It was called Baba Castle. The Baba continued to rule for about 200 years until they were conquered by the Edo. The Edo enlarged the castle and renamed it Mito Castle. In 1590, Satake Yoshinobu, a retainer of Toyotomi Hideyoshi, moved down from Oota and took over Mito Castle. He continued to rule until after the Battle of Sekigahara when he was moved to Kubota Castle in Akita Prefecture. At this point Tokugawa Ieyasu's fifth son, Takeda Nobuyoshi was made lord of Mito castle. The Tokugawa ruled over Mito Castle until the coming of the Meiji Restoration. All the castle buildings except a three story yagura and the yakuimon gate were destroyed during the Meiji Period. The yagura then burned down during WWII."
  },
  {
    "stampnumber": "015",
    "nameen": "Ashikagashi Yakata",
    "namejp": "足利氏館",
    "castlepic": "/images/castlepics/castle015.png",
    "stamppic": "/images/stamps/stamp015.png",
    "region": "Kanto",
    "prefecture": "Tochigi",
    "city": "Ashikaga",
    "type": "Fortified Manor",
    "condition": "No main keep but other buildings",
    "access": "Ashikagashi Sta. (Tobu Isezaki Line), 15 min. walk; Ashikaga Sta. (JR Ryomo Line), 10 min. walk",
    "website": "http://www.city.ashikaga.tochigi.jp/000index data/200sanmeisyo/020bannaji/bannaji.html",
    "history": "This site exemplifies one of the earliest forms of castles, a fortified residence. It is a square plot of land surrounded by a moat and guarded with gates at the entrances. The Ashikaga built this home in the mid 1100's. Ashikaga Yoshikane established the family temple on these grounds in 1196 and the site eventually became Bannaji Temple."
  },
  {
    "stampnumber": "016",
    "nameen": "Minowa Castle",
    "namejp": "箕輪城",
    "castlepic": "/images/castlepics/castle016.png",
    "stamppic": "/images/stamps/stamp016.png",
    "region": "Kanto",
    "prefecture": "Gunma",
    "city": "Takasaki",
    "type": "Hilltop",
    "condition": "No main keep but other buildings",
    "access": "Takasaki Sta. (Takasaki Line), 40 min. bus, 15 min. walk",
    "website": "https://www.city.takasaki.gunma.jp/docs/2013121600330/",
    "history": "Nagano Narihisa established his base here around 1500 from which his family ruled for 4 generations until the castle fell to Takeda Shingen in 1566. After the fall of the Takeda, the castle was taken over by Oda Nobunaga in 1582 and ruled by Takigawa Kazumasa. Less than a month later, the castle was taken over by the Gohojo and was ruled by Hojo Ujikuni from Hachigata Castle. In 1590, after the fall of the Hojo, Tokugawa Ieyasu stationed Ii Naomasa here. Ii Naomasa undertook a large renovation of the castle and most of today's castle structure and remnants are thought to be from this period. In 1598, Ii Naomasa moved to Takasaki Castle and Minowa Castle was abandoned."
  },
  {
    "stampnumber": "017",
    "nameen": "Kanayama Castle",
    "namejp": "金山城",
    "castlepic": "/images/castlepics/castle017.png",
    "stamppic": "/images/stamps/stamp017.png",
    "region": "Kanto",
    "prefecture": "Gunma",
    "city": "Ota",
    "type": "Mountaintop",
    "condition": "Ruins only",
    "access": "Ota Sta. (Tobu Isezaki Line); 50 min walk",
    "website": "http://www.city.ota.gunma.jp/gyosei/0100a/005/01/kanayamajo/index.html",
    "history": "Iwamatsu Iezumi built this castle in 1469. Yokose Narishige, a retainer of the Iwamatsu family, came to rule over it 1528. Around 1565, the Yokose changed their name to Yura. Kanayama Castle was attacked several times by some of the strongest powers in the area including Uesugi Kenshin (1574), Takeda Katsuyori (1580) and Satake Yoshishige (1583). It withstood all these attacks demonstrating its tough construction and great location.\n\nIn 1584, Yura Kunishige and his brother Nagao Akinaga (lord of Tatebayashi Castle) were captured by the Hojo of Odawara. In exchange for their release, they turned over the castle to the Hojo. During Hideyoshi's campaign against the Hojo, Maeda Toshiie took over of Kanayama Castle in 1590. It was decommissioned and not used after this time."
  },
  {
    "stampnumber": "018",
    "nameen": "Hachigata Castle",
    "namejp": "鉢形城",
    "castlepic": "/images/castlepics/castle018.png",
    "stamppic": "/images/stamps/stamp018.png",
    "region": "Kanto",
    "prefecture": "Saitama",
    "city": "Yorii",
    "type": "Hilltop",
    "condition": "No main keep but other buildings",
    "access": "Yorii Sta (Tobu Tojo Line), 25 min walk, or 800 yen by taxi.",
    "website": "http://www.town.yorii.saitama.jp/kanko/kanko page/kanko 11.html",
    "history": "The castle was first built by Nagao Kageharu around 1476 and was further fortified and renovated by Hojo Ujikuni when he became lord of the castle under his father Hojo Ujiyasu in 1560. The site of Hachigata Castle is one of the most ideal castle sites in all the Tokyo-Kanto area. It sits at the crossroads for much traffic coming from areas to the North (Shinshu and Joshu) and is nestled between two rivers (Ara River and Fukazawa River) with high cliffs on the Ara River side. Look at the photo of a map in the <a href=\"hachigata12.html\">last picture</a> to see this. These natural defenses along with the vast size of the castle made it a formidable defense for anyone attempting to attack the Hojo from this area.\n\nIn 1569 Hachigata Castle turned back the forces of Takeda Shingen, who was forced to go farther South. Then in 1590 when Toyotomi Hideyoshi made his final push towards Odawara to conquer the Hojo, Hachigata castle held off the combined armies of Maeda Toshiie and Uesugi Kagekatsu for a month with 3000 defenders. Ujikuni finally gave in and turned over the castle on the condition that the lives of his men were saved. The castle was later dismantled under the Tokugawa."
  },
  {
    "stampnumber": "019",
    "nameen": "Kawagoe Castle",
    "namejp": "川越城",
    "castlepic": "/images/castlepics/castle019.png",
    "stamppic": "/images/stamps/stamp019.png",
    "region": "Kanto",
    "prefecture": "Saitama",
    "city": "Kawagoe",
    "type": "Flatland",
    "condition": "No main keep but other buildings",
    "access": "Kawagoe Sta, Tobu Tojo Line, 20 min by tourist bus",
    "website": "http://museum.city.kawagoe.saitama.jp/hommaru/",
    "history": "Kawagoe Castle was founded in 1457 by Ota Doshin and his son Dokan under the order of Uesugi Mochitomo. In 1546 it was taken over by the Hojo until it fell again to Hideyoshi as part of his attack on Odawara and the Hojo.\n\nWhen the Tokugawa established their base of power at Edo (Tokyo), Kawagoe Castle functioned as an important defensive position for Edo. The city of Kawagoe likewise prospered as an important logistical hub for the transportation of food and other goods to and from Tokyo. This focus on logistics and trade also led to the abundance of storehouse style buildings you can still see today. In this old part of town you can also get a feeling for an Edo Period castle town."
  },
  {
    "stampnumber": "020",
    "nameen": "Sakura Castle",
    "namejp": "佐倉城",
    "castlepic": "/images/castlepics/castle020.png",
    "stamppic": "/images/stamps/stamp020.png",
    "region": "Kanto",
    "prefecture": "Chiba",
    "city": "Sakura",
    "type": "Hilltop",
    "condition": "Ruins only",
    "access": "Sakura Sta. (Keisei Dentetsu line), 15 min walk; Sakura Sta. (JR Sobu line), 20 min walk.",
    "website": "http://www.city.sakura.lg.jp/syoko/kanko english/nature.htm",
    "history": "Doi Toshikatsu started building this castle under the orders of Tokugawa Ieyasu in 1610. It took 7 years to complete. Doi built upon the unfinished work of the Chiba who had started building a castle called Kashima Castle on this site in the Sengoku Period. Throughout the Edo Period, Sakura Castle saw several powerful lords loyal to the Tokugawa rule from here. It was considered a strategically important location to protect the Eastern flank of Edo.\n\nThe castle was a large expansive castle which was famous for the fact that it had absolutely no stone walls. Only deep dry moats or earthen embankments to mark off the baileys and provide protection. The tenshu (main keep) was actually a yagura moved there from Edo Castle."
  },
  {
    "stampnumber": "021",
    "nameen": "Edo Castle",
    "namejp": "江戸城",
    "castlepic": "/images/castlepics/castle021.png",
    "stamppic": "/images/stamps/stamp021.png",
    "region": "Kanto",
    "prefecture": "Tokyo",
    "city": "Chiyoda",
    "type": "Hilltop",
    "condition": "No main keep but other buildings",
    "access": "Tokyo Station, among others",
    "website": "http://www.kunaicho.go.jp/11/d11-03.html",
    "history": "The history of Edo Castle dates back to the Heian Period when a fortified palace was built by the Edo clan on this site. In 1457 Ota Dokan constructed the first Edo Castle under the Uesugi clan. The castle remained under the control of the Uesugi family until the coming of the Tokugawa. Before Tokugawa Ieyasu, Edo (Tokyo) was just another town in the Kanto area. Partly due to Ieyasu's revolutionary city planning, the town of Edo developed at lightning speed and quickly became the social and political center of Japan.\n\nIn 1590, after Toyotomi Hideyoshi completed the unification of Japan he granted lordship over the greater Tokyo region to his lieutenant Tokugawa Ieyasu. Tokugawa could have ruled from the well established castle town of Odawara (80km west of Tokyo); instead, he took the opportunity to build a new city from the underdeveloped village of Edo. In a little over 100 years, Edo's population would grow to more than a million people, making it the largest city in the world.\n\nFor 264 years, 15 generations of Tokugawa ruled Japan from Edo Castle. The Tokugawa gave up control of the castle when they lost the Boshin war in 1868. The Emperor was restored as the ruler of Japan and moved to Edo Castle. At this time, the city was renamed Tokyo, or \"Eastern Capital\". The next time you are in Tokyo or even look at a map of the city, note the large green area in the middle and think about how the castle defined the city of Tokyo today."
  },
  {
    "stampnumber": "022",
    "nameen": "Hachioji Castle",
    "namejp": "八王子城",
    "castlepic": "/images/castlepics/castle022.png",
    "stamppic": "/images/stamps/stamp022.png",
    "region": "Kanto",
    "prefecture": "Tokyo",
    "city": "Hachioji",
    "type": "Mountaintop",
    "condition": "Ruins only",
    "access": "Takao Station (Chuo Line), bus for Reienmae (get off at Reienmae), 10 minute walk",
    "website": "http://www.city.hachioji.tokyo.jp/kyoiku/rekishibunkazai/bunkazai/shiseki/8216/006898.html",
    "history": "Hojo Ujiteru was one of the powerful lords of the Hojo family. He built this castle to strengthen the Hojo position in the area and help defend Odawara Castle from attack. After Odawara Castle was surrounded by Hideyoshi forces, Hojo Ujiteru, Hojo Ujimasa and Hojo Ujinao left to fight in Odawara leaving Hachioji Castle nearly defenseless. Soon after, the castle came under attack from Hideyoshi forces on June 23, 1590 and fell in one day. Hideyoshi later went on to defeat the Hojo at Odawara and complete the unification of Japan. It is said that Hideyoshi feared Ujiteru for his intelligence and prowess and that is a large part of why he demanded Ujiteru to commit suicide (seppuku) after he was captured.\n\nHachioji-jo was a great sprawling castle across the mountaintop with barricades built in strategic places to stall would be attackers or spies. The picture above of the entrance to what was originally the lord's palace. It is at the base of the mountain while the castle was actually at the top. There are a few small pieces of stone walls around the mountain but that is all that remains. The palace stood at the top of the hill across the bridge and was heavily fortified."
  },
  {
    "stampnumber": "023",
    "nameen": "Odawara Castle",
    "namejp": "小田原城",
    "castlepic": "/images/castlepics/castle023.png",
    "stamppic": "/images/stamps/stamp023.png",
    "region": "Kanto",
    "prefecture": "Kanagawa",
    "city": "Odawara",
    "type": "Hilltop",
    "condition": "Reconstructed main keep",
    "access": "Odawara Station (Tokaido Line), 10 minute walk",
    "website": "https://odawaracastle.com/",
    "history": "The history of Odawara Castle actually began in the 15th century with a stronghold built by the Omori Clan. After Hojo Soun conquered the area in 1495, he and his ancestors gradually expanded the castle as the Hojo clan gained power. At the height of their power, the Hojo controlled much of the Kanto area with support castles on the fringes in modern day Chiba, Ibaraki, Saitama, and Kanagawa prefectures.\n\nOdawara Castle faced three major attacks by Uesugi Kenshin in 1561, Takeda Shingen in 1569 and Toyotomi Hideyoshi in 1590. The last siege by Toyotomi Hideoyoshi was the end of the Hojo clan's supremacy and the castle was turned over to Tokugawa Ieyasu.\n\nAs the threat from Hideyoshi grew, the Hojo built out a great defensive perimeter, called the Sogamae (総構), around the castle consisting of over 9km of trenches and embankments. Most of the trenches were deep and had shojibori type defensive structures. They extend from the ocean in a horseshoe shaped ring up into the mountains around the castle providing very strong defenses and good lookouts in the mountains to watch over the gathering forces. This defensive perimeter was so impressive the idea was copied by some of the generals that participated in the siege and most notably by Hideyoshi himself in the design of the O-doi in Kyoto.\n\nIn Hideyoshi's Siege of Odawara, he brought many his generals from around the country with about 200,000 troops to bear on Odawara Castle. In the leadup to the siege, the various generals took over Hojo castles and strongholds on their way to Odawara. As Hideyoshi closed the net around Odawawa he flaunted his strength by creating an almost festival like atmosphere with performances and tea ceremonies and he even brought in his concubine (Yodo-dono) and tea master (Sen no Rikyu). Hideyoshi's stronghold for this siege was Ishigakiyama Castle which had a good view over the wider Odawara area. Hojo eventually conceded his defeat and turned over the castle with little bloodshed.\n\nOnce Tokugawa Ieyasu took control of the castle, he stationed his vassal Okubo Tadayo as castle lord. Okubo reduced the size of the castle from the Hojo days because it representated a threat to the Tokugawa power. The Okubo family ruled over Odawara for the entire Edo Period except for a brief period in the 1700's. The castle was dismantled in 1870."
  },
  {
    "stampnumber": "024",
    "nameen": "Tsutsujigasaki Palace",
    "namejp": "躑躅ヶ崎館",
    "castlepic": "/images/castlepics/castle024.png",
    "stamppic": "/images/stamps/stamp024.png",
    "region": "Kanto",
    "prefecture": "Yamanashi",
    "city": "Kofu",
    "type": "Flatland",
    "condition": "Ruins only",
    "access": "15 minutes bus ride from Kofu Station (Chuo Line)",
    "website": "http://www.takedajinja.or.jp/",
    "history": "Founded in 1519, this was the home and center of power for three generations of the Takeda (Nobutora, Shingen, and Katsuyori). The Takeda reached their pinnacle under Shingen who actually participated in a revolution that overthrew his father and sent him into exile when he found out that Nobutora was going to make Shingen's brother Nobushige his heir. Shingen is made famous in an old poem that claims \"men are your castle, men are your castle walls, men are your moats.\" This relates the emphasis that Shingen put in his people and during his rein he didn't build any castles beyond the fortification at Tsutsujigasaki."
  },
  {
    "stampnumber": "025",
    "nameen": "Kofu Castle",
    "namejp": "甲府城",
    "castlepic": "/images/castlepics/castle025.png",
    "stamppic": "/images/stamps/stamp025.png",
    "region": "Kanto",
    "prefecture": "Yamanashi",
    "city": "Kofu",
    "type": "Hilltop",
    "condition": "No main keep but other buildings",
    "access": "3 minute walk from Kofu Station (Chuo Line)",
    "website": "http://www.city.kofu.yamanashi.jp/kanko/history/0104.htm",
    "history": "Kofu Castle was built by Tokugawa Ieyasu in 1583 after he defeated Takeda shingen's heir, Katsuyori, in 1582. Next to Edo Castle, Kofu Castle was the strongest castle in the Kanto region. Until Yanagisawa Yoshiyasu became lord of Kofu Castle, it was also considered to be the residence of the lord closest to the shogun. From 1724 to the end of the Edo Period, the lord of Kofu Castle changed on a rotating basis with around 200 lords having held the title by the end of Edo Period. I have seen reference in some English materials/websites mistakenly claiming that this Kofu Castle (Maizuru Castle) was run by the Takeda. While Kofu was a castle town of the Takeda they actually ruled from the Tsutsujigasaki Yakata."
  },
  {
    "stampnumber": "026",
    "nameen": "Matsushiro Castle",
    "namejp": "松代城",
    "castlepic": "/images/castlepics/castle026.png",
    "stamppic": "/images/stamps/stamp026.png",
    "region": "Chubu",
    "prefecture": "Nagano",
    "city": "Nagano",
    "type": "Flatland",
    "condition": "No main keep but other buildings",
    "access": "Nagano Sta.; 30 min. bus for Matsushiro.",
    "website": "http://www.sanadahoumotsukan.com/facilities/facility.php?n=7",
    "history": "Takeda Shingen built the first castle on this site around 1560 as he battled with Uesugi Kenshin for control of the northern Shinano area. It was called Kaizu-jo and is the site of the famous Battle of Kawanakajima. After Shingen's death, lordship of the castle changed hands several times until 1622 when Sanada Nobuyuki became lord. Sanada Yukimichi, the third generation of Sanada lords, changed the name to Matsushiro Castle. The castle buildings were dismantled during the Meiji Period so there are no original structures left. The gates and walls you see today have been reconstructed faithfully using techniques and styles appropriate for the time and location."
  },
  {
    "stampnumber": "027",
    "nameen": "Ueda Castle",
    "namejp": "上田城",
    "castlepic": "/images/castlepics/castle027.png",
    "stamppic": "/images/stamps/stamp027.png",
    "region": "Chubu",
    "prefecture": "Nagano",
    "city": "Ueda",
    "type": "Flatland",
    "condition": "No main keep but other buildings",
    "access": "Ueda Sta. (Nagano Shinkansen, 15 min walk)",
    "website": "http://www.city.ueda.nagano.jp/hp/ht/koen/20050222110926630.html",
    "history": "Sanada Masayuki built Ueda Castle in 1583. In 1585 and 1600 he turned back two attacks by Tokugawa Ieyasu. Before the Battle of Sekigahara in 1600, Sanada met the forces of Tokugawa Hidetada at Ueda Castle. He repelled the 38,000 warriors of the Tokugawa with only 2500 castle defenders. The castle town was very well planned and the castle deftly made use of the rivers and landscape for its defense. This battle sufficiently delayed Hidetada so that he didn't arrive in time for the battle of Sekigahara.\n\nAfter the Battle of Sekigahara, Ueda Castle was given over to Sanada Nobuyuki who was ordered to destroy it by the Tokugawa. He razed the castle and moved to Matsushiro Castle. Sengoku Tadamasa started rebuilding Ueda Castle in 1622. He redug the moat and started restoring the Honmaru and Ninomaru before he died. His work was not continued after his death, but the structures you see today date to this time period.\n\nThe North, South and West yagura are all original."
  },
  {
    "stampnumber": "028",
    "nameen": "Komoro Castle",
    "namejp": "小諸城",
    "castlepic": "/images/castlepics/castle028.png",
    "stamppic": "/images/stamps/stamp028.png",
    "region": "Chubu",
    "prefecture": "Nagano",
    "city": "Komoro",
    "type": "Hilltop",
    "condition": "No main keep but other buildings",
    "access": "Komoro Sta. (Koumi Line, Shinano Testudou); 5 min. walk.",
    "website": "http://www.city.komoro.nagano.jp/kankou/kaikoen/index.html",
    "history": "During the Sengoku Period Takeda Shingen founded Komoro Castle on the grounds of two earlier castles called Otome Castle and Nabebuta Castle to help administer the Eastern Shinshu area. Sengoku Hidehisa became lord of the castle in 1590 and later his son Tadamasa expanded the castle further. The original Otemon gate (Important Cultural Property) and the foundation of the tenshu date from this time period."
  },
  {
    "stampnumber": "029",
    "nameen": "Matsumoto Castle",
    "namejp": "松本城",
    "castlepic": "/images/castlepics/castle029.png",
    "stamppic": "/images/stamps/stamp029.png",
    "region": "Chubu",
    "prefecture": "Nagano",
    "city": "Matsumoto",
    "type": "Flatland",
    "condition": "Original main keep",
    "access": "Matsumoto Station, 15 minute walk",
    "website": "\thttp://welcome.city.matsumoto.nagano.jp/contents03+index.id+3.htm",
    "history": "Next to Himeji-jo, Matsumoto-jo is the next best extant castle main keep in Japan. Built by Ishikawa Kazumasa and his son Yasunaga in 1590, Matsumoto-jo is designated a National Treasure. After Hideyoshi took Odawara he stationed Ishikawa Kazumasa in Matsumoto to govern his eastern provinces. The history of Matsumoto-jo actually begins with a castle called Fukashi-jo which was built by Shimadachi Sadanaga in 1504. That castle was attacked and captured by Takeda Shingen in 1550."
  },
  {
    "stampnumber": "030",
    "nameen": "Takato Castle",
    "namejp": "高遠城",
    "castlepic": "/images/castlepics/castle030.png",
    "stamppic": "/images/stamps/stamp030.png",
    "region": "Chubu",
    "prefecture": "Nagano",
    "city": "Ina",
    "type": "Hilltop",
    "condition": "No main keep but other buildings",
    "access": "Ina City Sta. (Ida Line), 25 min bus, 15 min walk",
    "website": "http://inashi-kankoukyoukai.jp/takatoh",
    "history": "It's not known when the original Takato Castle was actually built, but there was originally a fortification here controlled by the Takato clan for the Suwa. When Takeda Shingen attacked the Takato clan in 1545, he took over the castle and rebuilt it into a typical modern castle for the period. The castle was later taken over by Oda Nobunaga who fortified it with large dry moats around each of the kuruwa you see today.\n\nFrom the fall of the Shingen until the early Edo Period when the Naito became lords of the castle there was a succession of several castle lords. The Naito family ruled until the Meiji Restoration when the castle was decommissioned. The cherry blossoms you see at the park were planted in the Meiji Period."
  },
  {
    "stampnumber": "031",
    "nameen": "Shibata Castle",
    "namejp": "新発田城",
    "castlepic": "/images/castlepics/castle031.png",
    "stamppic": "/images/stamps/stamp031.png",
    "region": "Chubu",
    "prefecture": "Niigata",
    "city": "Shibata",
    "type": "Flatland",
    "condition": "Reconstructed main keep",
    "access": "Shibata Sta. (Uetsu Line), 20 min walk",
    "website": "http://www.city.shibata.niigata.jp/html/index02/shibatajo/",
    "history": "In the Sengoku Period, the Shibata clan ruled over this area and were aligned with Oda Nobunaga, Naturally, that put them at odds with Uesugi Kagekatsu who defeated them in 1587. In 1598, Mizoguchi Hidekatsu founded Shibata Castle under the orders of Toyotomi Hideyoshi. It was not completed until 1654 under the third generation Mizoguchi, Mizoguchi Nobunao. In 1872 when the Meiji Government ordered the castle to be dismantled it had 11 yagura and 5 gates. Of those 16 main structures only one gate and one yagura remain today. The majority of the Ninomaru and the Honmaru baileys are now occupied by the a Self Defense Forces base. Because of that you cannot enter the three story yagura."
  },
  {
    "stampnumber": "032",
    "nameen": "Kasugayama Castle",
    "namejp": "春日山城",
    "castlepic": "/images/castlepics/castle032.png",
    "stamppic": "/images/stamps/stamp032.png",
    "region": "Chubu",
    "prefecture": "Niigata",
    "city": "Joetsu",
    "type": "Mountaintop",
    "condition": "No main keep but other buildings",
    "access": "Kasugayama Sta. (Shin'etsu Line); 45 min walk",
    "website": "http://www.city.joetsu.niigata.jp/site/kanko/meisho-jo-04.html",
    "history": "The Kasugayama Castle we see today was constructed by Nagao Tamekage and his son Uesugi Kenshin. There was an older castle on this site that dates to the 14th century, but little is known about it. Kenshin's successor, Kagekatsu became lord of the castle after Kenshin's death in 1578. 20 years later, Kagekatsu moved to Aizu and Hori Hideharu became lord of Kasugayama Castle. Hori built a new castle, called Echigo Fukushima Castle, on a more flatland location closer to the harbor and in 1607 Kasugayama Castle was abandoned.\n\nKasugayama Castle was one of the largest and strongest fortresses built in the Sengoku Period. The castle had no stone walls but there were many enclosures and dry moats built around the mountain. Kasugayama Castle was also protected by a network of forts and other castles in the area. Kasugayama Castle was never attacked so we'll never know how well it may have withstood an invasion."
  },
  {
    "stampnumber": "033",
    "nameen": "Takaoka Castle",
    "namejp": "高岡城",
    "castlepic": "/images/castlepics/castle033.png",
    "stamppic": "/images/stamps/stamp033.png",
    "region": "Chubu",
    "prefecture": "Toyama",
    "city": "Takaoka",
    "type": "Flatland",
    "condition": "Ruins only",
    "access": "Takaoka Sta. (Hokuriku Line), 10 min walk",
    "website": "http://www.e-tmm.info/siro.htm",
    "history": "Maeda Toshinaga built Takaoka Castle in 1609 after Toyama Castle burned down. Toshinaga died in 1614. The castle was decommissioned in 1615, before it was even finished, under the One Castle per Domain law. It was designated as a park in 1875."
  },
  {
    "stampnumber": "034",
    "nameen": "Nanao Castle",
    "namejp": "七尾城",
    "castlepic": "/images/castlepics/castle034.png",
    "stamppic": "/images/stamps/stamp034.png",
    "region": "Chubu",
    "prefecture": "Ishikawa",
    "city": "Nanao",
    "type": "Mountaintop",
    "condition": "Ruins only",
    "access": "Nanao Sta, Nanao Line; 5km (take a taxi)",
    "website": "http://www.city.nanao.lg.jp/odekake/guide miru.html:02",
    "history": "The Hatakeyama built up and fortified Nanao Castle so that in its prime it was one of the 5 strongest mountaintop castles in Japan. Eventually the castle fell to Uesugi Shingen in 1577 after a long protracted battle. This battle escalated the fighting between Oda Nobunaga and Uesugi. After the Uesugi were defeated and Maeda Toshiie took control of this area he built a new castle in Nanao city, but instead of making use of the ruins of this Nanao Castle he built one at Komaruyama, closer to the city center. Recent excavations show that Nanao castle was even larger than previously believed and they are considering expanding the historical site."
  },
  {
    "stampnumber": "035",
    "nameen": "Kanazawa Castle",
    "namejp": "金沢城",
    "castlepic": "/images/castlepics/castle035.png",
    "stamppic": "/images/stamps/stamp035.png",
    "region": "Chubu",
    "prefecture": "Ishikawa",
    "city": "Kanazawa",
    "type": "Hilltop",
    "condition": "No main keep but other buildings",
    "access": "Kanazawa Sta. (Hokuriku Line), 15 minutes by bus",
    "website": "http://www.pref.ishikawa.jp/siro-niwa/kanazawajou/",
    "history": "The castle was first founded by Sakuma Morimasa, a retainer of Oda Nobunaga, and nephew of Shibata Katsuie in 1580. He started to build up the castle and castle town but was defeated and executed by Hideyoshi at the Battle of Shizugatake in 1583. After the battle, Maeda Toshiie, an ally of Hideyoshi, who held the neighboring Noto province was also given Kaga province. It was taken over by Maeda Toshiie, who built up the castle in earnest. In 1585, Maeda was also granted the lands of Ecchu, making him one of the richest lords under the Toyotomi regime. The Maeda clan established a prosperous province which allowed them to rule peacefully for 14 generations until the end of the Meiji period.\n\nThe castle originally had a large six-level main keep, but it burned down in 1602 and was never rebuilt. Kanazawa Castle had several fires that destroyed parts of the castle over the years. The Kenrokuen Garden was built at about the same elevation as the Honmaru of the castle in 1676 and gradually expanded over 150 years. Formally it was intended for entertaining, but if any attackers made it this far into the city it's the perfect location to build a base for further attacks on the castle, so it was lightly fortified as a satellite fortification of the main castle."
  },
  {
    "stampnumber": "036",
    "nameen": "Maruoka Castle",
    "namejp": "丸岡城",
    "castlepic": "/images/castlepics/castle036.png",
    "stamppic": "/images/stamps/stamp036.png",
    "region": "Chubu",
    "prefecture": "Fukui",
    "city": "Sakai",
    "type": "Hilltop",
    "condition": "Original main keep",
    "access": "Awara-onsen Sta. (Hokuriku Line), Keifuku bus to Hon-maruoka and get off at Shiro-iriguchi (20mins, buses hourly). Hourly buses (Keifuku) also run from Fukui station",
    "website": "http://www.city.fukui-sakai.lg.jp/static/00000027/002/00000099.html",
    "history": "Maruoka-jo was Built by Shibata Katsutoyo, nephew of Shibata Katsuie, in 1576. The castle had 17 lords until the Meiji Restoration including Aoyama Shurinsuke, Honda Narishige, and Arima Kiyosumi. The keep was levelled by the Fukui earthquake of 1948, but the keep was rebuilt using 80% of the original materials in 1955. The keep has three stories with an original wood interior and stone-tile roof, and is located on a hill in the middle of a rather large plain. Both the size of the keep and interior are very similar to that of Inuyama castle."
  },
  {
    "stampnumber": "037",
    "nameen": "Ichijodani Castle",
    "namejp": "一乗谷城",
    "castlepic": "/images/castlepics/castle037.png",
    "stamppic": "/images/stamps/stamp037.png",
    "region": "Chubu",
    "prefecture": "Fukui",
    "city": "Fukui",
    "type": "Mountaintop",
    "condition": "No main keep but other buildings",
    "access": "Fukui Sta. (Hokuriku Line), 25min bus; or, Ichijodani Sta (Etsumihoku Line), walk",
    "website": "http://www.city.fukui.lg.jp/d620/bunka/iseki/00gaiyo.html",
    "history": "Asakura Takakage established his family home and castle at Ichijodani in 1471. During the Onin War, many elite and educated people escaped to Ichijodani making it the cultural center of the Echizen Province. The fifth Asakura lord, Yoshikage sided with the Ashikaga against Nobunaga. Yoshikage failed in an attempt to capture Oda Nobunaga and fled to Ohno leaving Ichijodani open to attack. Nobunaga attacked and burned Ichijodani in 1573. The castle deftly makes use of the long thin valley between two mountains. At both ends of the valley were narrow openings with strong gates that opened up into a flourishing castle town. The castle at the top of the mountain had three main baileys and numerous dry moats and earthen embankments protecting it."
  },
  {
    "stampnumber": "038",
    "nameen": "Iwamura Castle",
    "namejp": "岩村城",
    "castlepic": "/images/castlepics/castle038.png",
    "stamppic": "/images/stamps/stamp038.png",
    "region": "Chubu",
    "prefecture": "Gifu",
    "city": "Ena",
    "type": "Mountaintop",
    "condition": "No main keep but other buildings",
    "access": "Iwamura Sta. (Akechi Tetsudo), 10 min. walk",
    "website": "http://www.kankou-ena.jp/see/shiro/iwamurajou/",
    "history": "The history of Iwamura Castle dates back to the Kamakura Period when Kato Kagekado, a retainer of Minamoto no Yoritomo founded the castle. However, it is lkely that Kato stayed with the Minamoto in Kamakura and the first person to actually go to Iwamura and build the castle was his son Toyama Kagetomo who came in 1195. The Toyama continued to rule until the Sengoku Period.\n\nToyama Kageto, the last Toyama lord, ruled Iwamura as a retainer of of Oda Nobunaga. Iwamura Castle was besieged by Takeda Shingen in 1570, but with the help of Nobunaga it was successfully defended. Toyama Kageto suddenly died of illnes in 1571 leaving only his young adopted son (Nobunga's fifth son) and his wife (Nobunaga's aunt).\n\nAkiyama Nobutomo, under the command of Takeda Shingen, took advantage of this weakness and attacked again in 1572. This time Kageto's widow negotiated a surrender of the castle. She agreed to wed Nobutomo for her own protection and sent her adopted son (Nobunaga's son) off to be cared for by Takeda Shingen.\n\nAfter the crushing defeat to Oda and Tokugawa forces at Nagashino in 1575, the Takeda power was severely cripppled. Oda took this opportunity to take back Iwamura Castle. After a 5 month siege, Nobutomo negotiated a surrender that guaranteed their lives would be spared. Nobunaga however did not honor their truce and executed Nobutomo and his wife (Nobunaga's aunt) at the Nagara River by upside-down hanging. This cruel punishment, normally dealt to traitors, was a sign of Nobunaga's anger at his son being sent to Takeda.\n\nKawajiri Hidetaka, who first ruled Iwamura Castle under Nobunaga rebuilt much of the castle to it's modern structure. The castle was ruled by various lords until it was dismantled in 1873 under the castle abolishment law. Iwamura Castle is famous as one of the three best mountaintop castles and is also one of the top 100."
  },
  {
    "stampnumber": "039",
    "nameen": "Gifu Castle",
    "namejp": "岐阜城",
    "castlepic": "/images/castlepics/castle039.png",
    "stamppic": "/images/stamps/stamp039.png",
    "region": "Chubu",
    "prefecture": "Gifu",
    "city": "Gifu",
    "type": "Mountaintop",
    "condition": "Reconstructed main keep",
    "access": "Gifu Sta. (Tokaida main line), 15 min bus to Gifu Park",
    "website": "http://lifelong.lifelong.city.gifu.gifu.jp/gy71user/2018.htm",
    "history": "Gifu-jo, originally called Inabayama-jo, is built atop the 338m Mt. Kinka in Gifu prefecture. A castle was first established here by Nikaido Yukimasa in around 1201, but the Saito clan built the first proper castle here in the 15th C. Saito Dosan became the master of Inabayama-jo In 1539 and renovated it into mostly into what you see today. In 1567 Oda Nobunaga invaded Mino and took Inabayama-jo from Saito Yoshitatsu, the grandson of Saito Dosan. Nobunaga moved his headquarters here from Komaki Castle and renamed it Gifu Castle. Nobunaga built the tower atop the mountain and his great palace at the base. Nobunaga stayed here until he built Azuchi Castle in 1579. Nobunaga's descendents continued to rule Gifu Castle until the Battle of Sekigahara. During the Battle of Sekigahara (1600) Tokugawa's forces captured Gifu Castle which was then controlled by Nobunaga's grandson Hidenobu. Tokugawa had no need for a small mountaintop castle so it was abandoned and replaced by a new flatland castle, Kano Castle nearby. It is said that Kano Castle was built using some materials including the main keep from Gifu Castle."
  },
  {
    "stampnumber": "040",
    "nameen": "Yamanaka Castle",
    "namejp": "山中城",
    "castlepic": "/images/castlepics/castle040.png",
    "stamppic": "/images/stamps/stamp040.png",
    "region": "Chubu",
    "prefecture": "Shizuoka",
    "city": "Mishima",
    "type": "Mountaintop",
    "condition": "Ruins only",
    "access": "Mishima Station (Tokaido Honsen), 30-40 minute bus ride",
    "website": "http://www.sengoku-shizuoka.com/castle/3119012/",
    "history": "This castle was founded by Hojo Ujiyasu to protect the main Hojo stronghold at Odawara. It was part of a string of fortifications that inlcuded Nirayama Castle and Ashigara Castle. As relations between Hojo and Toyotomi Hideyoshi worsened, Hojo Ujimasa began to strengthen the fortifications of Yamanaka Castle around 1587. At this time, the Daisaki Demaru Bailey was constructed to overlook the road leading to Odawara. In 1590 before Hojo had completed the new fortifications, Hideyoshi launched the full force of nearly 70,000 troops against the meager 4,000 defenders of Yamanaka Castle. It is said that the castle fell in less than a half day and in only 2 hours by some accounts. This was the first assault by Hideyoshi on Odawara in his campaign to overthrew the Hojo."
  },
  {
    "stampnumber": "041",
    "nameen": "Sunpu Castle",
    "namejp": "駿府城",
    "castlepic": "/images/castlepics/castle041.png",
    "stamppic": "/images/stamps/stamp041.png",
    "region": "Chubu",
    "prefecture": "Shizuoka",
    "city": "Shizuoka",
    "type": "Flatland",
    "condition": "No main keep but other buildings",
    "access": "Shizuoka Station (Tokaido main line), 10 minute walk",
    "website": "http://www.sengoku-shizuoka.com/castle/2102056/",
    "history": "Sunpu Castle originally started as a yakata, or fortified palace, for Imakawa Norimasa in the 1400's. However, the exact location of this palace or any other details about it are unknown. An actual castle of the type of castle we think of today was built by Tokugawa Ieyasu in 1585. The main keep of Sunpu Castle was said to have been built three times. The second by Ieyasu in 1605 after he turned over the shogunate to Hidetada and the third was two years later after it burned down in a fire. The third keep also burned to the ground in another fire in 1635 and was never rebuilt. The castle lasted in this state until the Meiji Period when the it was dismantled and the moats were filled in. Sunpu Castle is most well known as the \"retirement castle\" of Ieyasu after he relinquished the shogunate to Hidetada."
  },
  {
    "stampnumber": "042",
    "nameen": "Kakegawa Castle",
    "namejp": "掛川城",
    "castlepic": "/images/castlepics/castle042.png",
    "stamppic": "/images/stamps/stamp042.png",
    "region": "Chubu",
    "prefecture": "Shizuoka",
    "city": "Kakegawa",
    "type": "Hilltop",
    "condition": "Reconstructed main keep",
    "access": "Kakegawa Station (Tokaido Honsen), 10 minute walk",
    "website": "http://www.city.kakegawa.shizuoka.jp/kanko/siro.htm",
    "history": "Imagawa Yoshitada had his retainer Asahina Yasuhiro build Kakegawa Castle about 0.5km to the northeast of the present castle to help control this vital point of the Tokaido road. In 1569, his descendent, Asahina Yasutomo, lost the castle to Tokugawa Ieyasu's forces. In 1590, the area was absorbed by Toyotomi Hideyoshi who stationed Yamanouchi Kazutoyo here when Tokugawa moved to Edo (Tokyo).\n\nYamanouchi built the main keep on the current site and renovated the castle and town into a more modern castle. After the Battle of Sekigahara, Yamanouchi was moved to Kochi. Yamanouchi's main keep was destroyed in an earthquake in 1604 but was soon rebuilt. The new keep lasted until 1854 when it destroyed by another earthquake. It was not rebuilt and the castle was dismantled in 1869."
  },
  {
    "stampnumber": "043",
    "nameen": "Inuyama Castle",
    "namejp": "犬山城",
    "castlepic": "/images/castlepics/castle043.png",
    "stamppic": "/images/stamps/stamp043.png",
    "region": "Chubu",
    "prefecture": "Aichi",
    "city": "Inuyama",
    "type": "Hilltop",
    "condition": "Original main keep",
    "access": "Inuyama Yuen Station (Meitetsu), 15 minute walk",
    "website": "http://www.inuyama.gr.jp/miru/kokuhouinuyamajyo.html",
    "history": "The castle as it stands today was established in 1537 by Nobunaga's grandfather Oda Nobuyasu.\n\nAccording to a Heian period book called \"Enkishiki,\" at the site where Inuyama castle now stands, there was a shrine called Harigane Shrine (Harigane Jinja). This temple was later moved to Shirayamadaira to make way for the castle. The castle was not entirely constructed from scratch, but the main keep was actually moved here from a different castle known as Kanayama Castle.\n\nAfter Hideyoshi took Odawara, he stationed Ishikawa Sadakiyo at Inuyama castle. Following the Battle of Sekigahara, Ishikawa was defeated and Matsudaira Tadayoshi (master of Kiyosu castle) stationed his retainer Ogasawara Yoshitsugu in Inuyama Castle. In 1616 Ogasawara was replaced by Naruse Masanari and his family have more or less owned the castle through the present day.\n\nInuyama-jo was famous for being the only privately owned castle in Japan. It had a few different owners early on, and was seized by the Meiji government who held it in their possession from 1872 to 1895. It suffered damage during an earthquake in 1891 and was returned to the Naruse family in 1895 under the condition that they repair the damages continue to keep up the castle into the future. It was recently sold to the city of Inuyama and will soon be taken over by Aichi Prefecture."
  },
  {
    "stampnumber": "044",
    "nameen": "Nagoya Castle",
    "namejp": "名古屋城",
    "castlepic": "/images/castlepics/castle044.png",
    "stamppic": "/images/stamps/stamp044.png",
    "region": "Chubu",
    "prefecture": "Aichi",
    "city": "Nagoya",
    "type": "Flatland",
    "condition": "Reconstructed main keep",
    "access": "Shiyakusho Station (subway Meijo Line)",
    "website": "https://www.nagoyajo.city.nagoya.jp/",
    "history": "In 1610 Tokugawa Ieyasu ordered the construction of Nagoya-jo to solidify the Tokugawa authority in Owari (Nagoya and vicinity). The castle was completed in 1612 and Tokugawa's ninth son Yoshinao entered the castle in 1616 from which he governed over Owari. Nagoya-jo is famous for the 2 golden shachihoko that adorn the top of its main keep. That is why it is also known as \"Kinshachi-jo.\" Kin means \"gold\" and shachi refers to the killer whale type mythical creatures that sit atop the main keep and other castle structures."
  },
  {
    "stampnumber": "045",
    "nameen": "Okazaki Castle",
    "namejp": "岡崎城",
    "castlepic": "/images/castlepics/castle045.png",
    "stamppic": "/images/stamps/stamp045.png",
    "region": "Chubu",
    "prefecture": "Aichi",
    "city": "Okazaki",
    "type": "Hilltop",
    "condition": "Reconstructed main keep",
    "access": "HIgashi Okazaki Station (Meitetsu Line), 15 minute walk",
    "website": "https://okazaki-kanko.jp/okazaki-park/feature/okazakijo/top",
    "history": "Saigo Tsugiyori built the original fortification on this site in 1455. Matsudaira Kiyoyasu captured the castle in 1524 and his famous grandson Matsudaira Motoyasu (Tokugawa Ieyasu) was born here on December 16, 1542. Ieyasu succeeded to lord of the castle in 1560 and left his eldest son Nobuyasu in charge when he moved to Hamamatsu Castle in 1570. The castle was left to the Tanaka clan when the Tokugawa moved to Edo (Tokyo) in 1590. The Tanaka worked to expand the castle and build out the castle town. When the Okazaki Domain was established the loyal retainer Honda Yasushige was made lord of the Okazaki Domain. The domain changed hands a few times during the Edo Period and was abolished in 1873."
  },
  {
    "stampnumber": "046",
    "nameen": "Nagashino Castle",
    "namejp": "長篠城",
    "castlepic": "/images/castlepics/castle046.png",
    "stamppic": "/images/stamps/stamp046.png",
    "region": "Chubu",
    "prefecture": "Aichi",
    "city": "Shinshiro",
    "type": "Flatland",
    "condition": "Ruins only",
    "access": "Nagashinojo Sta. (Iida line); 8 min walk",
    "website": "http://www.city.shinshiro.lg.jp/index.cfm/1,8420,118,664,html",
    "history": "Suganuma Motonari built this castle at the confluence of the Ure River and Kansa River. These 2 rivers provided natural barriers for the castle. The Suganuma were retainers of the Takeda but the castle was taken over by forces loyal to Tokugawa. In 1585, when Okudaira Sadamasa was lord of the castle, it once again came under attack and was surrounded by Takeda Katsuyori's forces. It was saved by a combined force of allies to Oda Nobunaga and Tokugawa Ieyasu. This Battle of Nagashino has became famous as the first modern Japanese battle. Oda's forces used a number of wooden stockades to blunt the Takeda cavalry charges while troops of gunners in alternating lines continuously fired volleys on them from behind the stockades. This was the first battle to show the utility of guns if properly employed and was a step away from tradition hand to hand combat."
  },
  {
    "stampnumber": "047",
    "nameen": "Iga Ueno Castle",
    "namejp": "伊賀上野城",
    "castlepic": "/images/castlepics/castle047.png",
    "stamppic": "/images/stamps/stamp047.png",
    "region": "Chubu",
    "prefecture": "Mie",
    "city": "Iga",
    "type": "Hilltop",
    "condition": "Reconstructed main keep",
    "access": "Uenoshi Sta. (Kintetsu Iga Line); 10 min walk",
    "website": "http://www.ict.ne.jp/~uenojyo/",
    "history": "Takigawa Katsutoshi started construction of Iga Ueno Castle in 1585. He was followed by Tsutsui Sadatsugu who built the honmaru and three level main keep. After the Battle of Sekigahara (1608), Sadatsugu's lands were confiscated by the Tokugawa and given to Todo Takatora. Todo Takatora initiated a great renovation of the castle to fortify the defenses against a resurgance of Toyotomi's followers. The new design created a new honmaru, the huge stone walls and completely engulfed the original castle. After the destruction of the Toyotomi, however, the renovation plans were mostly abandoned and the main keep, which was destroyed by high winds, was never rebuilt."
  },
  {
    "stampnumber": "048",
    "nameen": "Matsusaka Castle",
    "namejp": "松阪城",
    "castlepic": "/images/castlepics/castle048.png",
    "stamppic": "/images/stamps/stamp048.png",
    "region": "Chubu",
    "prefecture": "Mie",
    "city": "Matsusaka",
    "type": "Hilltop",
    "condition": "No main keep but other buildings",
    "access": "15 mins walk from station or take bus and stop at Shimin-Byoin mae",
    "website": "http://www.city.matsusaka.mie.jp/kankou/otherlanguage/english sp.html",
    "history": "Gamo Ujisato built Matsusaka Castle in 1588 in a style and structure that closely resembles Azuchi Castle. Ujisato put much effort into developing the castle town. He adopted the Rakuichi-rakuza system (free trade), built/redirected the new Sangu-kaido road leading to Ise, moved in moneylenders from Matsugashima castle, merchants from Hino in Omi, and shipping agents. Later, under Tokugawa Yorinobu, merchants moved to Edo became rich, and were entrusted with the right to print hansatsu, money bills of Kishu-han. City is famous for Matsusaka momen, Ise Oshiroi, Gikaku-shi, nowadays beef."
  },
  {
    "stampnumber": "049",
    "nameen": "Odani Castle",
    "namejp": "小谷城",
    "castlepic": "/images/castlepics/castle049.png",
    "stamppic": "/images/stamps/stamp049.png",
    "region": "Kansai",
    "prefecture": "Shiga",
    "city": "Nagahama",
    "type": "Mountaintop",
    "condition": "Ruins only",
    "access": "Kawake Sta. (JR Hokuriku main trunk line); 30 mins walk from the station to the museum and trail head",
    "website": "http://www.eonet.ne.jp/~odanijou-s/index.html",
    "history": "Azai Sukemasa built Odani Castle from 1521-1528. The third generation castle lord, Azai Nagamasa married OIchi-no-kata, Nobunaga's younger sister in 1567 to expand his power and influence. Despite that, he turned on Nobunaga in his campaign against the Asakura in 1570. Nobunaga defeated the Asakura and Azai at the Battle of Anegawa in 1570, but was not able to take Odani Castle until 1573.\n\nOIchi gave birth to three daughters, OChacha (Toyotomi Hideyoshi's sokushitsu), OHatsu (married Kyogoku Takatsugu), and OGo (married Tokugawa Hidetada).\n\nOdani Castle is counted among Japan's Five Greatest Mountain Castles, along with Kasugayama Castle, Nanao Castle, Kannonji Castle and Gassantoda Castle."
  },
  {
    "stampnumber": "050",
    "nameen": "Hikone Castle",
    "namejp": "彦根城",
    "castlepic": "/images/castlepics/castle050.png",
    "stamppic": "/images/stamps/stamp050.png",
    "region": "Kansai",
    "prefecture": "Shiga",
    "city": "Hikone",
    "type": "Hilltop",
    "condition": "Original main keep",
    "access": "Hikone Station (Tokaido Honsen), walk 15 minutes",
    "website": "https://www.hikoneshi.com/jp/castle/",
    "history": "For his participation in the Battle of Sekigahara, Ii Naomasa was awarded the lands surrounding Sawayama Castle. Due to its inconvenient location and poor condition, he soon started planning for a new castle on a new location that would become Hikone Castle.\n\nUnfortunately, Naomasa died soon after and the castle was actually begun under his son Naotsugu. It took 20 years and was completed under Naotsugu's brother Naotaka who had become lord of the castle in 1615. The main keep of Hikone-jo is famous for having used several types of gables and construction techniques to make it well fortified. The main keep and connected yagura are designated National Treasures. I find it amazing that the Ii family maintained their rule over Hikone Castle for over 250 years from the beginning of the Edo Period until the Meiji restoration."
  },
  {
    "stampnumber": "051",
    "nameen": "Azuchi Castle",
    "namejp": "安土城",
    "castlepic": "/images/castlepics/castle051.png",
    "stamppic": "/images/stamps/stamp051.png",
    "region": "Kansai",
    "prefecture": "Shiga",
    "city": "Azuchi",
    "type": "Hilltop",
    "condition": "Ruins only",
    "access": "Azuchi Station (JR Tokaido Line)",
    "website": "http://en.biwako-visitors.jp/spot/detail/157",
    "history": "By 1575 Nobunaga had become the most powerful samurai in the country. He turned over control of the Owari & Mino provinces to his eldest son Nobutada and set his own eyes on the unification of all Japan. In 1576, Nobunaga established his new castle and power base at Azuchi on Lake Biwa. This was a very strategic location in that it gave him significant control over the nearby Tokaida and Nakasendo roads to Kyoto and any traffic on Lake Biwa.\n\nIt took 3.5 years to complete the main keep and entire castle. Unfortunately, the castle was short lived. After Nobunaga was killed by Akechi Mitsuhide in 1582 at Honnoji Temple, Azuchi Castle was burned to the ground in a battle between Nobunaga's second son Nobukatsu and Akechi's men who had taken over the castle.\n\nThe construction of Azuchi Castle was a revolution in castle design and marked the turning point in a new type of castle. Until this time, most were smaller mountaintop structures that were only used as a lookout or as needed. Nobunaga's Azuchi castle led the way for the larger and more grand structures of the late Sengoku Period and Early Edo Period turning castles in to quarters for the daimyo and some retainers.\n\nThe main keep itself was 7 stories high and thought to have been the largest multi-storied wooden building in the world at that time. The fifth floor of the main keep was an octagon representing heaven and the quadrangular sixth floor represented the thoughts of Taoism and Confucianism."
  },
  {
    "stampnumber": "052",
    "nameen": "Kannonji Castle",
    "namejp": "観音寺城",
    "castlepic": "/images/castlepics/castle052.png",
    "stamppic": "/images/stamps/stamp052.png",
    "region": "Kansai",
    "prefecture": "Shiga",
    "city": "Azuchi",
    "type": "Mountaintop",
    "condition": "Ruins only",
    "access": "Azuchi Sta. (JR Tokaido Line)",
    "website": "http://www.town.azuchi.shiga.jp/tourist/01.html",
    "history": "It's not known exactly when this castle was built but the oldest records show it existed as early as 1335 and was probably built by the Sasaki. At one point during the Onin War the castle was turned over to the Ashikaga for a short term.\n\nThe Rokkaku rebuilt much of the castle during the Sengoku Period, but they gradually lost power and the castle was abandoned. In 1560, Rokkaku Yoshikata lost an important battle to the Asai Clan. The execution of Goto Katatoyo in 1563 created much dissention among the Rokkaku retainers. When Nobunaga took control of the region in 1568, the Rokkaku were simply swept aside and they fled the castle. After Nobunaga built Azuchi Castle just a few kilometers away, Kannonji Castle was most likely abandoned but some stories say it was still used in a minor capacity.\n\nThe original castle nearly covered the mountain with baileys, stone walls and earthen walls. It was one of the most extensive mountaintop castles built."
  },
  {
    "stampnumber": "053",
    "nameen": "Nijo Castle",
    "namejp": "二条城",
    "castlepic": "/images/castlepics/castle053.png",
    "stamppic": "/images/stamps/stamp053.png",
    "region": "Kansai",
    "prefecture": "Kyoto",
    "city": "Kyoto",
    "type": "Flatland",
    "condition": "No main keep but other buildings",
    "access": "Nijojomae Station (subway Tozai Line) 4 min walk",
    "website": "http://www.city.kyoto.jp/bunshi/nijojo/",
    "history": "Nijo-jo began as a mansion built by Nobunaga in 1569. The castle Nijo-jo was erected in 1603 to be Tokugawa Ieyasu's headquarters when he was in Kyoto. The main keep was struck by lightning and burned to the ground in 1750. It was never rebuilt. Ieyasu's palace is filled with beautiful works of art and is very well preserved. The Ninomaru Palace was mainly used for administrative affairs and reflects this in the many offices and meeting rooms it contains. It is designated a National Treasure."
  },
  {
    "stampnumber": "054",
    "nameen": "Osaka Castle",
    "namejp": "大坂城",
    "castlepic": "/images/castlepics/castle054.png",
    "stamppic": "/images/stamps/stamp054.png",
    "region": "Kansai",
    "prefecture": "Osaka",
    "city": "Osaka",
    "type": "Flatland",
    "condition": "Reconstructed main keep",
    "access": "JR Osakajo Koen Station",
    "website": "http://www.osakacastle.net/english/",
    "history": "Toyotomi Hideyoshi built Osaka-jo in 1583. Hideyoshi, being the great battle expert he was, designed the most formidable castle ever built in Japan. One large moat surrounded the whole castle with only two ways across it. One of those was a small bridge that could be easily defended or even destroyed if necessary. The inner grounds which contained the large main keep were actually built 3 levels above the water level of the moat. Any attacker would have to scale three high stone walls and climb over 3 sets of turrets to get to the inner grounds. No castle is invincible and in 1615 it fell to the Tokugawa forces. Hideyoshi's heir, Hideyori, committed suiced before being captured. In 1620 Tokugawa completely renovated the entire castle and built a new main keep making the whole castle even bigger and grander than Hideyoshi's original. In 1665 the main keep was struck by lightning and burned to the ground. It was never rebuilt."
  },
  {
    "stampnumber": "055",
    "nameen": "Chihaya Castle",
    "namejp": "千早城",
    "castlepic": "/images/castlepics/castle055.png",
    "stamppic": "/images/stamps/stamp055.png",
    "region": "Kansai",
    "prefecture": "Osaka",
    "city": "Osaka",
    "type": "Mountaintop",
    "condition": "Ruins only",
    "access": "Bus from Kawachinagano Station or Tondabayashi Station",
    "website": "http://www.chihayaakasaka.org/e-index.html",
    "history": "Chihaya Castle was built in 1332 by Kusunoki Masashige, a loyalist to Emperor Go-Daigo. After the fall of nearby Akasaka Castle, Kusunoki built up Chihaya Castle to defend against the Hojo. When they attacked in 1333, he successfully forced them out. The tactics used by Kusunoki to defend the castle, such as creating dummy warriors with straw and extra armor, knocking down trees and pushing boulders onto enemies as they tried to ascend, etc. have made the Siege of Chihaya Castle one of Japan's stand-out military battle tales.\n\nChihaya Castle remained under the emperor's domain until the Ashikaga overtook it in 1390. The castle was then abandoned."
  },
  {
    "stampnumber": "056",
    "nameen": "Takeda Castle",
    "namejp": "竹田城",
    "castlepic": "/images/castlepics/castle056.png",
    "stamppic": "/images/stamps/stamp056.png",
    "region": "Kansai",
    "prefecture": "Hyogo",
    "city": "Asago",
    "type": "Mountaintop",
    "condition": "Ruins only",
    "access": "Takeda Station (Bantan Line); 60 min walk or 15 min taxi (1500 yen)",
    "website": "https://www.city.asago.hyogo.jp/takeda/",
    "history": "Takeda Castle was built on this site in the path of aggression between Harima/Tanba and Tajima regions as a stronghold of Izushi Castle. It was built by Ohtagaki Mitsukage, a retainer of Yamana Sozen, lord of the area, in 1441. Ohtagaki, who had been a military commander of the Yamana clan for 5 generations became lord of the castle.\n\nTakeda Castle was conquered by Hideyoshi in his Tajima campaign of 1577. Hideyoshi placed it in the control of his younger brother, Hidenaga, who moved to Izushi less than 2 years later. In 1585 Akamatsu Hirohide became the new lord of the castle and was charged with renovating it as a stronger castle to help control the Ikuno silver mines. The stone walls date from this period. Akamatsu Hirohide, the last lord of the castle, fought on the side of the Western Forces for Tokugawa at the battle of Sekigahara in the attack on Tottori Castle. Hirohide served valiantly in the battle, but was accused of setting the castle town on fire. Later that year he committed seppuku and Takeda Castle was abandoned."
  },
  {
    "stampnumber": "057",
    "nameen": "Sasayama Castle",
    "namejp": "篠山城",
    "castlepic": "/images/castlepics/castle057.png",
    "stamppic": "/images/stamps/stamp057.png",
    "region": "Kansai",
    "prefecture": "Hyogo",
    "city": "Sasayama",
    "type": "Hilltop",
    "condition": "No main keep but other buildings",
    "access": "Sasayama-guchi Station (Fukuchiyama Line), 30 min bus, 5 min walk",
    "website": "https://visit.sasayama.jp/en/2017/09/01/83/",
    "history": "From the top of Mt. Takashiro to the Southeast of Sasayama Castle the Hatano ruled over the Tanba area from Yagami Castle. Yagami Castle fell to attacks by Akechi Mitsuhide in 1579. In 1608 Tokugawa Ieyasu's son Matsudaira Yasushige became lord of Yagami Castle. The following year, Ieyasu started the construction of Sasayama Castle while dismantling Yagami Castle as part of his plan to better control the western lords and fortify Osaka Castle. The castle was designed by Todo Takatora and completed in less than a year."
  },
  {
    "stampnumber": "058",
    "nameen": "Akashi Castle",
    "namejp": "明石城",
    "castlepic": "/images/castlepics/castle058.png",
    "stamppic": "/images/stamps/stamp058.png",
    "region": "Kansai",
    "prefecture": "Hyogo",
    "city": "Akashi",
    "type": "Hilltop",
    "condition": "No main keep but other buildings",
    "access": "Akashi Sta (San'yo Line), 5 min walk",
    "website": "http://www.hyogo-park.or.jp/akashi/contents/sisetsu/map01 2.html",
    "history": "Ogasawara Tadazane (former lord of Matsumoto), moved into the area in 1617. In 1619, under the orders of Tokugawa Hidetada he built Akashi Castle in just one year for the purposes of watching over the Western lords and building up the Tokugawa defenses in the region. He accomplished building this castle in so little time mainly because he used materials from castles in the area that were decomissioned under the one castle per country law of 1615. The castle deftly makes use of the natural terrain in a 3 tiered castle compound. Ogasawara's father-in-law Honda Tadamasa, who also directed the construction of Himeji Castle, assisted with the construction of Akashi castle. Even though they build a large foundation for a large main keep, no main keep was ever built. In it's place the honmaru had 4 large 3 story yagura, two of which are still standing today. Eventually, Ogasawara Tadazane was moved to Kokura Castle and the lordship of Akashi Castle changed hands several times until it was taken over by Matsudaira Naoakira in 1682. The Matsudaira continued to ruled until the coming of the Meiji Restoration."
  },
  {
    "stampnumber": "059",
    "nameen": "Himeji Castle",
    "namejp": "姫路城",
    "castlepic": "/images/castlepics/castle059.png",
    "stamppic": "/images/stamps/stamp059.png",
    "region": "Kansai",
    "prefecture": "Hyogo",
    "city": "Himeji",
    "type": "Hilltop",
    "condition": "Original main keep",
    "access": "Himeji Station (Sanyo Honsen/Shinkansen), walk 15 minutes.",
    "website": "https://www.city.himeji.lg.jp/castle/",
    "history": "Himeji Castle's early history dates to the 14th century when Akamatsu Norimura built a fortification on this site. Himeyama Castle was then built by his son in 1346. The castle starts to come into prominence during the Sengoku Period when it was renovated by the Kuroda Shigetaka in 1545. In 1580, Nobunaga took control of Harima proving and placed it under the control of Toyotomi Hideyoshi who remodeled the castle and built a small keep. You can still see some of the remnants of Hideyoshi's castle in Himeji castle as Ikeda incoporated some of the stone walls and gates into his castle. Ikeda Terumasa, an ally of Tokugawa Ieyasu at the Battle of Sekigahara, was awarded this province (Harima) for his alliance during the war. Ikeda Terumasa built the main keep of Himeji-jo and erected the castle as it is known today. Himeji-jo's nickname Shirasagi-jo means \"White Heron Castle\" because the main keep with its three smaller towers resembles a white heron. Himeji-jo was granted \"World Heritage\" status by UNESCO in 1993."
  },
  {
    "stampnumber": "060",
    "nameen": "Ako Castle",
    "namejp": "赤穂城",
    "castlepic": "/images/castlepics/castle060.png",
    "stamppic": "/images/stamps/stamp060.png",
    "region": "Kansai",
    "prefecture": "Hyogo",
    "city": "Ako",
    "type": "Flatland",
    "condition": "No main keep but other buildings",
    "access": "Banshuako Sta. (Ako Line); 15 min walk",
    "website": "http://www.ako-hyg.ed.jp/bunkazai/akojo/",
    "history": "When Asano Naganao was transferred here in 1648 he was instructed by the Tokugawa government to build a new castle. Originally the ocean would have come close to the southern boundaries of the castle providing direct access to the sea. The vast castle had 10 corner turrets, 12 gates and the length of the outer baileys is nearly 3km long. There is a main keep foundation at Ako Castle but the main keep was never built because the Tokugawa Bakufu never granted permission to do so. Ako Castle was dismantled in 1873."
  },
  {
    "stampnumber": "061",
    "nameen": "Takatori Castle",
    "namejp": "高取城",
    "castlepic": "/images/castlepics/castle061.png",
    "stamppic": "/images/stamps/stamp061.png",
    "region": "Kansai",
    "prefecture": "Nara",
    "city": "Takatori",
    "type": "Mountaintop",
    "condition": "Ruins only",
    "access": "Tsubosakayama Sta. (Kintetsu Yoshino Line), 15 min bus, 45 min hike",
    "website": "http://sightseeing.takatori.info/sightseeingspot/siroato cg.project.html",
    "history": "Ochi Kunizumi built the original castle on this site in 1332 as a satellite to their main fortification art Kaibukiyama Castle. The Ochi controlled the castle until the mid 16th C. It took part in several uprisings and was an important castle in the Ochi's defenses. Takatori Castle was abandoned by order of Oda Nobunaga in 1580 when he named Yamato Koriyama the ruling castle in the region. After the death of Nobunaga, Tsutsui Junkei began rebuilding the castle as part of his defensive network in 1584, but Tsutsui died shortly thereafter and his heir Sadatsugu was also moved to Iga. Toyotomi Hidenaga became lord of Yamato Koriyama Castle and with these lands also came Takatori Castle. Honda Toshihisa was assigned the defense of Takatori Castle and he redesigned the layout and defenses into what you see today. The Honda ruled the castle until 1640 when Uemura Iemasa became the new lord. The Uemura clan continued to rule until the Meiji Restoration.\n\nAs the Edo Period led to a more peaceful time in Japanese history, the Uemura lords moved their residence from the top of the mountain down to the castle town below, to the area known as the Shimoyashiki. For much of the Edo Period, the lord's residence was \"lower\" than his retainers who lived farther up the mountain. Around the former Shimoyashiki, there is a part of a clay wall remaining (sorry, no photos) and in the castle town you'll find a Nagayamon Gate that has been repurposed as the gate to a doctor's office. The gate to the Uemura's residence also remains in the castle town where their descendents still live there today."
  },
  {
    "stampnumber": "062",
    "nameen": "Wakayama Castle",
    "namejp": "和歌山城",
    "castlepic": "/images/castlepics/castle062.png",
    "stamppic": "/images/stamps/stamp062.png",
    "region": "Kansai",
    "prefecture": "Wakayama",
    "city": "Wakayama",
    "type": "Hilltop",
    "condition": "Reconstructed main keep",
    "access": "Wakayama Station (Nankai Line, JR Hanwa Line); 15 min bus to Koenmae bus stop, or walk 20 mins",
    "website": "http://www.wakayamakanko.com/eng/sightseeing/history1.html",
    "history": "In 1585, under the orders of his older brother Toyotomi Hideyoshi, Toyotomi Hidenaga established Wakayama Castle to help rule over the Kii area. When the castle was finished, Hidenaga had made Yamato Koriyama Castle his home base and stationed Kuwayama Shigeharu here in his place.\n\nAsano Yoshinaga was stationed at Wakayama Castle after the Battle of Sekigahara. In 1619, Tokugawa Ieyasu's 10th child Yorinobu became lord of the castle. From that point until the Meiji Restoration the castle was ruled by successive Tokugawa lords.\n\nEven after the Meiji Restoration, the beautiful main keep was kept intact and designated a National Treasure. Unfortunately, it burned to the ground during bombings in 1945. Wakayama Castle together with Himeji Castle and Iyo-Matsuyama Castle are called the Three Great Flatland Mountain Castles."
  },
  {
    "stampnumber": "063",
    "nameen": "Tottori Castle",
    "namejp": "鳥取城",
    "castlepic": "/images/castlepics/castle063.png",
    "stamppic": "/images/stamps/stamp063.png",
    "region": "Chugoku",
    "prefecture": "Tottori",
    "city": "Tottori",
    "type": "Mountaintop",
    "condition": "No main keep but other buildings",
    "access": "Tottori Sta. (San'in Line, 5 minute bus, 5 min walk; 30+ min walk to the top of the mountain and the honmaru",
    "website": "http://www.torican.jp/famous/look/index.html#01",
    "history": "Yamana Nobumichi built Tottori Castle in 1545. The castle is well known for a famous attack that took place in 1581 when Hideyoshi laid siege to the castle for 200 days. After exhausting their supplies, Kikkawa Tsuneie, lord of the castle, gave up on the condition that his soldier's lives be spared. Miyabe Keijun took over the castle at this point, but was replaced by Ikeda Nagayoshi after the Battle of Sekigahara. Ikeda expanded or rebuilt much of the castle."
  },
  {
    "stampnumber": "064",
    "nameen": "Matsue Castle",
    "namejp": "松江城",
    "castlepic": "/images/castlepics/castle064.png",
    "stamppic": "/images/stamps/stamp064.png",
    "region": "Chugoku",
    "prefecture": "Shimane",
    "city": "Matsue",
    "type": "Hilltop",
    "condition": "Original main keep",
    "access": "Matsue Station (San'in line); Lakeline Bus 10 min.",
    "website": "http://www.matsue-tourism.or.jp/m castle/",
    "history": "Horio Yoshiharu was awarded the lands around Izumo for his participation in the Battle of Sekigahara. After 3 generations of Horio rule and one of Kyogoku, the castle was passed to one of Tokugawa Ieyasu's grandson's Matsudaira Naomasa. The Matsudaira ruled for 234 years until the castle was dismantled during the Meiji Period. Fortunately, the main main keep you see above was saved."
  },
  {
    "stampnumber": "065",
    "nameen": "Gassan Toda Castle",
    "namejp": "月山富田城",
    "castlepic": "/images/castlepics/castle065.png",
    "stamppic": "/images/stamps/stamp065.png",
    "region": "Chugoku",
    "prefecture": "Shimane",
    "city": "Yasugi",
    "type": "Mountaintop",
    "condition": "No main keep but other buildings",
    "access": "3000 yen taxi or very infrequent bus (Yellow Bus) from Yasugi Sta.",
    "website": "http://www.city.yasugi.shimane.jp/p/2/11/4/3/5/",
    "history": "The original castle here was built around the end of the Heian Period or early Kamakura Period, but it is not known exactly when or by whom a castle first constructed on this site. It was the home of the Amago clan during the end of the Sengoku Period until they were conquered by Mori Motonari in 1565. In 1600, Horio Yoshiharu moved into the castle and rebuilt and fortified the castle. Horio decided that that Gassan area was not conducive to developing a thriving economy so he started work on Matsue Castle. Gassan Toda Castle was abandoned in 1611 when Horio moved to Matsue."
  },
  {
    "stampnumber": "066",
    "nameen": "Tsuwano Castle",
    "namejp": "津和野城",
    "castlepic": "/images/castlepics/castle066.png",
    "stamppic": "/images/stamps/stamp066.png",
    "region": "Chugoku",
    "prefecture": "Shimane",
    "city": "Tsuwano",
    "type": "Mountaintop",
    "condition": "No main keep but other buildings",
    "access": "Tsuwano Sta. (Yamaguchi Line)",
    "website": "http://tsuwano-kanko.net/sightseeing/look/津和野城跡/",
    "history": "Yoshimi Yoriyuki established this castle, originally called Sanbonmatsu-jo, to watch over the province of Iwami. His family ruled here for 14 generations. Yoshimi Hironaga, the 14th generation, supported the Mouri clan in the Battle of Sekigahara (1600) and was moved to Hagi with them after they lost to the Tokugawa forces.\n\nSakazaki Naomori was awarded this domain for his support and success at the Battle of Sekigahara. Starting from the Demaru Bailey he started to vastly expand and fortify the castle. The stone walls you see at the top of the mountain date from this time period. Naomori died in 1616 leaving no descendents. Kamei Masanori was moved here in his place where his family ruled for 11 generations until the coming of the Meiji Period when the castle was dismantled.　The tenshu burned down in a fire caused by lightning in 1686. The castle was dismantled in 1873."
  },
  {
    "stampnumber": "067",
    "nameen": "Tsuyama Castle",
    "namejp": "津山城",
    "castlepic": "/images/castlepics/castle067.png",
    "stamppic": "/images/stamps/stamp067.png",
    "region": "Chugoku",
    "prefecture": "Okayama",
    "city": "Tsuyama",
    "type": "Hilltop",
    "condition": "No main keep but other buildings",
    "access": "Tsuyama Sta. (Tsuyama Line); 15 min walk",
    "website": "http://www.city.tsuyama.okayama.jp/chikujo400/",
    "history": "For his success at the Battle of Sekigahara Mori Tadamasa was awarded part of the Mimasaka area. He started construction of the castle in 1604 and completed the castle in 1616. After four generations, the Mori were replaced by Matsudaira Nobutomi. Tsuyama Castle was one of the most well fortified castles ever constructed in Japan. It had so many yagura and gates it was considered to be over fortified. The castle was dismantled during the Meiji Restoration."
  },
  {
    "stampnumber": "068",
    "nameen": "Bitchu Matsuyama Castle",
    "namejp": "備中松山城",
    "castlepic": "/images/castlepics/castle068.png",
    "stamppic": "/images/stamps/stamp068.png",
    "region": "Chugoku",
    "prefecture": "Okayama",
    "city": "Takahashi",
    "type": "Mountaintop",
    "condition": "Original main keep",
    "access": "Bitchu Takahashi Station (Hakubi Line); 1260 taxi",
    "website": "http://takahasikanko.or.jp/modules/spot/?content id=1",
    "history": "Bitchu Matsuyama Castle is well know as being the highest altitude castle in Japan at 480 meters. This was viewed as a strategic location was also viewed as valuable territory for a castle. Akiba Shigenobu built the first castle on a nearby mountain in 1240. In 1331 Takahashi Muneyasu built the first Matsuyama Castle on this site. The main keep and yagura you see today were built by Mizunoya in 1683. This was one of very few 2 level main keep, but being on top of the mountain, there was little need to build a high vantage point. After the Mizunoya there were several different lords until Itakura Katsuyoshi in 1744. His descendents continued to rule until the Meiji restoration."
  },
  {
    "stampnumber": "069",
    "nameen": "Kinojo Castle",
    "namejp": "鬼ノ城",
    "castlepic": "/images/castlepics/castle069.png",
    "stamppic": "/images/stamps/stamp069.png",
    "region": "Chugoku",
    "prefecture": "Okayama",
    "city": "Soja",
    "type": "Mountaintop",
    "condition": "No main keep but other buildings",
    "access": "Hattori Sta. (Kibi Line); 2000 yen Taxi or 5.5km hike (see notes below)",
    "website": "http://www.city.soja.okayama.jp/bunka/bunka sport/hakubutu/kinojouzan vc.html",
    "history": "The history of Kinojo is unclear since it is not mentioned in any historical records. It is believed that it was built by the Yamato Court in the Seventh Century to defend from foreign invaders. There were some 30 castles built around that time in Western Japan, of which, 27 have been located. Kinojo was discovered in 1971 and is currently thought to be the oldest castle in Japan. The outer wall is approximately 2.8 km long, with 4 main gates and one large defensive platform."
  },
  {
    "stampnumber": "070",
    "nameen": "Okayama Castle",
    "namejp": "岡山城",
    "castlepic": "/images/castlepics/castle070.png",
    "stamppic": "/images/stamps/stamp070.png",
    "region": "Chugoku",
    "prefecture": "Okayama",
    "city": "Okayama",
    "type": "Hilltop",
    "condition": "Reconstructed main keep",
    "access": "Okayama Sta. (San'yo Line); 20 min walk, 10 min bus",
    "website": "http://www.city.okayama.okayama.jp/keizai/kankou/ujo/",
    "history": "Ukita Naoie began construction of the castle in 1573 but it was not completed until 1597 by his son Hideie. After the Battle of Sekigahara, Kobayakawa Hideaki was given control of the castle but he died just two years later. Ikeda Terumasa's second son, Ikeda Tadatsugu (a grandson of Tokugawa Ieyasu), became the new lord of the castle. The Ikeda family continued to rule until the Meiji Period. This was another one of the great castles of the Edo Period but was unfortunately destroyed in the air raids of 1945."
  },
  {
    "stampnumber": "071",
    "nameen": "Fukuyama Castle",
    "namejp": "福山城",
    "castlepic": "/images/castlepics/castle071.png",
    "stamppic": "/images/stamps/stamp071.png",
    "region": "Chugoku",
    "prefecture": "Hiroshima",
    "city": "Fukuyama",
    "type": "Hilltop",
    "condition": "Reconstructed main keep",
    "access": "Fukuyama Sta. (San'yo line); 2 minute walk",
    "website": "http://www.city.fukuyama.hiroshima.jp/fukuyamajyo/",
    "history": "In 1619, Mizuno Katsunari, a cousin of Tokugawa Ieyasu, was the first of the Tokugawa hereditary vassals (fudai daimyo) to be stationed in the Chuugoku region. He was placed here at Fukuyama to be just between the non-hereditary vassals (tozama daimyo) in Hiroshima and Okayama. He received great support from the Tokugawa in the form of money, materials and buildings transferred from Fushimi Castle to build this rather large and strong castle (23 yagura and 10 gates) quickly. It shows the importance Tokugawa placed on showing his strength to these tozama daimyo. The castle was completed in 1622.\n\nFukuyama Castle was one of the greatest castles of the Edo Period and many buildings survived the Meiji Restoration, but were mostly destroyed in the air raids of 1945. Only the Fushimi Yagura and Sujigane Gate survived."
  },
  {
    "stampnumber": "072",
    "nameen": "Koriyama Castle",
    "namejp": "郡山城",
    "castlepic": "/images/castlepics/castle072.png",
    "stamppic": "/images/stamps/stamp072.png",
    "region": "Chugoku",
    "prefecture": "Hiroshima",
    "city": "Akitakata",
    "type": "Mountaintop",
    "condition": "Ruins only",
    "access": "Yokogawa Sta (San'yo Line) 80 min bus to Yoshida Elementary School, 15 min walk to trail head",
    "website": "https://akitakata-kankou.jp/touristspot/462/",
    "history": "The earliest origins of Koriyama Castle are unknown, but there are some indications that the Mori had a Yoshida Castle here in the 1300's. it seems likely that it was the old Koriyama Castle or Koriyama Honjo Castle on a southeastern ridge. The castle was expanded in the 1500's to the castle you see today covering most of the mountaintop and the side facing the town. It had stone walls around the central compound, buildings with clay tiled roofs and residences for high ranking retainers and soldiers. The vast mountain fortress was like a combination of a Sengoku Mountaintop Castle and later castles that combined military functions, political power and residences for the lord and retainers. In 1540, the Amako, who had been steadily amassing power attacked the castle with over 30,000 soldiers. The 3,000 defenders held out for four months until a relief force from the Ouchi arrived with 10,000 men. Another force from the Shishido also arrived to turn the tide against the Amako. Amako Hisayuki was killed in battled as the Amako took heavy losses and eventually retreated a month later.\n\nKoriyama castle was abandoned in 1591 when the Mori moved to their new castle, Hiroshima Castle."
  },
  {
    "stampnumber": "073",
    "nameen": "Hiroshima Castle",
    "namejp": "広島城",
    "castlepic": "/images/castlepics/castle073.png",
    "stamppic": "/images/stamps/stamp073.png",
    "region": "Chugoku",
    "prefecture": "Hiroshima",
    "city": "Hiroshima",
    "type": "Flatland",
    "condition": "Reconstructed main keep",
    "access": "Hiroshima Station, bus or local train",
    "website": "http://www.rijo-castle.jp/rijo/main.html",
    "history": "Hiroshima-jo was built by Mori Terumoto in 1591. Mori Terumoto was a very powerful daimyo who controlled the vast majority of the San'in and San'yo areas. Having outgrown his Yoshida-Koriyama castle he built a new castle at Hiroshima in 1599. Mori Terumoto aligned himself with the Western forces in the Battle of Sekigahara (1600). The Western forces lost and Mori's lands were confiscated. He was then appointed to govern most of what is modern day Yamaguchi prefecture.\n\nOne of Hideyoshi's former allies, Fukushima Masanori filled Terumoto's place at Hiroshima. After Fukushima was stationed in Hiroshima, it's said that he got nostalgic for his old days under Hideyoshi. Needless to say, this did not sit well with the Tokugawa. In 1617 a great flood caused much damage to Hiroshima-jo. Fukushima petitioned the Tokugawa government for permission to fix it but he never received an answer. According to Tokugawa law, all daimyo needed permission to build, rebuild or renovate any castle. The only reply Fukushima got from the Tokugawa was \"under investigation\" and permission never came.\n\nTwo years later he proceeded on his own and started to fix the flood damage. Fukushima was caught in a Tokugawa trap. Since he defied their laws, they took away his lands around Hiroshima and gave him a smaller, less profitable province in modern day Nagano prefecture.\n\nHiroshima-jo lasted through the Meiji Restoration and was named a National Treasure in 1931 only to be destroyed by the atomic bomb in WWII."
  },
  {
    "stampnumber": "074",
    "nameen": "Iwakuni Castle",
    "namejp": "岩国城",
    "castlepic": "/images/castlepics/castle074.png",
    "stamppic": "/images/stamps/stamp074.png",
    "region": "Chugoku",
    "prefecture": "Yamaguchi",
    "city": "Iwakuni",
    "type": "Mountaintop",
    "condition": "Reconstructed main keep",
    "access": "Iwakuni Station (San'yo Honsen), 20 minutes by bus to the Kintaikyo Bridge, 10 minute walk to the ropeway to the top",
    "website": "https://www.iwakuni-kanko.com/kikko/shiro/",
    "history": "Iwakuni-jo was built by Kikkawa Hiroie in 1608. Just a few years later in 1615 the castle was torn down to comply with the Tokugawa law of \"one castle per province.\" The current reconstruction was placed a little bit closer to the front edge of the mountain so it could be more easily seen from below and to give visitors a better view of the valley from the castle."
  },
  {
    "stampnumber": "075",
    "nameen": "Hagi Castle",
    "namejp": "萩城",
    "castlepic": "/images/castlepics/castle075.png",
    "stamppic": "/images/stamps/stamp075.png",
    "region": "Chugoku",
    "prefecture": "Yamaguchi",
    "city": "Hagi",
    "type": "Flatland",
    "condition": "Ruins only",
    "access": "Higashi Hagi Sta. (San'in Line), bus",
    "website": "http://www.hagishi.com/miru/",
    "history": "After losing to Tokugawa at the Battle of Sekigahara, Mori Terumoto's lands around Hiroshima were confiscated. Tokugawa wanted to lock the Mori into a remote location on the Japan Sea so they commanded him to build his castle at Hagi. If you visit Hagi you'll see how far and difficult a place it is to get to. The Mori family continued to rule over Hagi until the Meiji restoration. In 1863, Mori Takachika moved the major government functions of the domain to Yamaguchi, because Hagi was too vulnerable to bombardment from the sea. From this point Hagi started losing it's importance and many of the castle buildings were dismantled. In the Meiji Restoration the main keep and the remainder of the buildings were destroyed.\n\nThe structure of Hagi Castle is actually very interesting and Mori built a brilliantly defensible little castle. Mt Shizuki is a small mountain right on the coast creating a small peninsula of land. The castle sits at the base of the mountain facing the land and occupies all the approachable land to the mountain. Stone walls and defensible positions on the coast prevent attack from the sea. The Honmaru, Ninomaru and Sannomaru baileys extend towards the land protecting the castle from a land invasion. The Sannomaru Bailey encloses much of the castle town which has numerous walled streets, narrow streets, T-junctions and dead ends to confuse and make it difficult for any attacker to reach the castle. A scattering of watchtowers, gates and strategically placed storehouses for weapons would have made any attack on Hagi very difficult indeed. At the top of the mountain is the Tsumenomaru, a fallback position in case of a siege."
  },
  {
    "stampnumber": "076",
    "nameen": "Tokushima Castle",
    "namejp": "徳島城",
    "castlepic": "/images/castlepics/castle076.png",
    "stamppic": "/images/stamps/stamp076.png",
    "region": "Shikoku",
    "prefecture": "Tokushima",
    "city": "Tokushima",
    "type": "Hilltop",
    "condition": "No main keep but other buildings",
    "access": "Tokushima Sta. (Tokushima Line) or Highway Bus, 10 min walk",
    "website": "http://www.city.tokushima.tokushima.jp/johaku/index.shtml",
    "history": "In 1385, Hosokawa Yoriyuki built Inoyama Castle on the present site of Tokushima Castle. After Toyotomi forces conquered Shikoku, Hachisuka Iemasa was appointed the lord of Awa Province (present day Tokushima Prefecture.) Initially, Hachisuka Iemasa based his headquarters at Ichinomiya Castle. However, it turned out to be a rather inconvenient location to govern Awa, so he moved to Tokushima Castle in 1585. The existing fortifications were enlarged and improved.\n\nThe castle is located in the heart of Tokushima City, on a 62m hill called Inoyama. The castle is a renkaku-style hilltop castle with a Honmaru (Main Bailey), Higashi Ninomaru (Eastern Second Bailey), Nishi Ninomaru (Western Second Bailey), and Nishi Sannomaru (Western Third Bailey) located up on the hill with additional baileys: Nishinomaru Yashiki, Baba, Goten, and Miki Bailey at the base of the hill. Initially, a castle keep was built in the Honmaru at the top of the hill, but it was pulled down and a new three-storey castle keep without the usual stonewall foundation (tenshudai) was built in the Higashi Ninomaru in the early Edo Period. The castle lasted eight years into the Meiji Period before it was demolished in 1875. Only the Washimon (Washi Gate) in the Miki Bailey survived, but it was destroyed during a WWII air raid in July 1945. The current Washimon was rebuilt in 1989 to mark the centenary of Tokushima City."
  },
  {
    "stampnumber": "077",
    "nameen": "Takamatsu Castle",
    "namejp": "高松城",
    "castlepic": "/images/castlepics/castle077.png",
    "stamppic": "/images/stamps/stamp077.png",
    "region": "Shikoku",
    "prefecture": "Kagawa",
    "city": "Takamatsu",
    "type": "Flatland",
    "condition": "No main keep but other buildings",
    "access": "Takamatsu Sta. (Yosan Line); 10 min walk",
    "website": "http://www.takamatsujyo.com",
    "history": "Ikoma Chikamasa was stationed in Takamatsu by Toyotomi Hideyoshi in 1587. He started building the castle in 1588 and it was completed in 1590. Four generations of Ikoma ruled Takamatsu until the 11 year old Takatoshi was re-stationed to the remote Dewa Province in Northeastern Japan in 1639 with greatly reduced lands. This was a punishment for conflicts caused by the Ikoma clan and their retainers. Tokugawa Ieyasu's grandson, Matsudaira Yorishige, replaced Ikoma in Takamatsu. The Matsudaira family continued to rule until the Meiji Period.\n\nIn the Edo Period, Takamatsu Castle had a 3 level, 5 story main keep and about 20 yagura. It is uniquely constructed on the waterfront where it draws water from the ocean for it's moats. It is considered one of the 3 great water or waterfront castles. The castle was decomissioned in 1869 and the main keep was torn down in 1884.\n\nThere is a strong movement in Takamatsu to rebuild the castle main keep as it was, but they are facing difficulties due to a lack of quality pictures and information about its original structure. At one point there was a reward for old photos or information that would help to rebuild it accurately."
  },
  {
    "stampnumber": "078",
    "nameen": "Marugame Castle",
    "namejp": "丸亀城",
    "castlepic": "/images/castlepics/castle078.png",
    "stamppic": "/images/stamps/stamp078.png",
    "region": "Shikoku",
    "prefecture": "Kagawa",
    "city": "Marugame",
    "type": "Hilltop",
    "condition": "Original main keep",
    "access": "Marugame Sta. (Yosan Line), 10 minute walk",
    "website": "http://www.city.marugame.lg.jp/sightseeing/spot/marugamejo/index.html",
    "history": "Ikoma Chikamasa, the lord of the Sanuki area originally ruled from Takamatsu Castle. While there, he built and moved to Marugame Castle placing his son in charge of Takamatsu Castle. Marugame Castle was decomissioned as part of the one castle per country law in 1615.\n\nMarugame Castle was resurrected in 1641 when Yamazaki Ieharu was granted the small fief of Western Sanuki. He rebuilt the castle into what we see today and developed the surrounding castle town of Marugame."
  },
  {
    "stampnumber": "079",
    "nameen": "Imabari Castle",
    "namejp": "今治城",
    "castlepic": "/images/castlepics/castle079.png",
    "stamppic": "/images/stamps/stamp079.png",
    "region": "Shikoku",
    "prefecture": "Ehime",
    "city": "Imabari",
    "type": "Flatland",
    "condition": "Reconstructed main keep",
    "access": "Imabari Station, 10 minutes by bus",
    "website": "http://www.islands.ne.jp/imabari/kanko/kuwa/ima castle/",
    "history": "For his services during the Battle of Sekigahara Takatora Todo was awarded this large parcel of land on the Iyo peninsula. Takatora began construction of the castle in 1602 and moved here from his castle at Uwajima in 1608 when the palace was completed. That same year he was restationed at Tsu in Ise Prefecture. His adopted son, Takayoshi, took oover Imabari.\n\nIn 1635, Takatora's adopted son Takayoshi was reassigned and Sadafusa Matsudaira moved in. Imabari Castle was then controlled by the Matsudaira until the Meiji Restoration. The location of Imabari Castle is very important as a strategic militarily point from which to control traffic through the Seto Sea.\n\nThe main keep of Imabari Castle was disassembled in 1610 and carried to Osaka. It was originally supposed to become the main keep of Igaueno Castle but was instead rebuilt as the main keep of Kameyama Castle."
  },
  {
    "stampnumber": "080",
    "nameen": "Yuzuki Castle",
    "namejp": "湯築城",
    "castlepic": "/images/castlepics/castle080.png",
    "stamppic": "/images/stamps/stamp080.png",
    "region": "Shikoku",
    "prefecture": "Ehime",
    "city": "Matsuyama",
    "type": "Mountaintop",
    "condition": "No main keep but other buildings",
    "access": "Matsuyama Sta (Yosan Line); streetcar 20 min to Dogo Kouen-mae stop",
    "website": "http://www.dogokouen.jp/dogokouen/park shisetsu.html",
    "history": "During the Nanboku-chô period (1336-1392), Kono Michimori moved the clans' home base from Kono-Gun to Yuzuki Castle in Dogo which was a more prosperous area. Despite intervention by the Hosokawa and internal family disputes, the clan served the Ashikaga Shogun family, and was allied with neighboring clans including the Ouchi, Otomo and Mori. Around 1535, Kono Michinao constructed the outer moat of the castle thus giving it two large moats and increasing its defences. He also strengthened his relationship with Murakami Michiyasu, son-in-law and pirate leader of the Inland Sea (Kurushima). In 1585, another Michinao (Ushifukumaru), the last heir, surrendered the castle to Toyotomi Hideyoshi. This was the end of the Kono clan in Iyo. Yuzuki Castle was briefly ruled by Fukushima Masanori until it was abandoned."
  },
  {
    "stampnumber": "081",
    "nameen": "Matsuyama Castle",
    "namejp": "松山城",
    "castlepic": "/images/castlepics/castle081.png",
    "stamppic": "/images/stamps/stamp081.png",
    "region": "Shikoku",
    "prefecture": "Ehime",
    "city": "Matsuyama",
    "type": "Hilltop",
    "condition": "Original main keep",
    "access": "Matsuyama Station (15 minutes by city bus)",
    "website": "http://www.matsuyamajo.jp",
    "history": "The original castle was built here in 1603 by Kato Yoshiakira. It had a large 5 story main keep that was actually moved to Aizu when Kato was transferred there in 1627. Tadachika Gamoh became the new lord of Matsuyama castle and completed construction of the Ninomaru before he died in 1635, leaving no heirs. In 1635, Matsudaira Sadayuki moved into Matsuyama Castle and the Matsudaira family ruled over the area until the end of feudalism. Sadayuki rebuilt the main keep with three stories in 1642. This main keep was struck by lightning and burned down on New Year's day in 1784. The construction of the current main keep was not begun until 1820 and not completed until 1854. From 1926 on, many of the yagura, gates and other structures were destroyed by arson and bombings in WWII. As a relative of the Tokugawa shogun, Matsudaira Sadaaki naturally fought for the Tokugawa in several battles at the Meiji Restoration. Once the emperor regained political power, Sadaaki was a wanted man and considered an enemy of the emperor. In order to avoid attack, he decided to submit and allow Tosa soldiers into the castle while he sought penance and refuge in Joshinji temple in Matsuyama. His sincerity was accepted and thus Sadaaki and Matsuyama Castle were saved from attack. The Matsudaira family eventually gave the castle to the city of Matsuyama in 1923. The city has been working since 1966 to repair the original structures and rebuild those that were destroyed."
  },
  {
    "stampnumber": "082",
    "nameen": "Ozu Castle",
    "namejp": "大洲城",
    "castlepic": "/images/castlepics/castle082.png",
    "stamppic": "/images/stamps/stamp082.png",
    "region": "Shikoku",
    "prefecture": "Ehime",
    "city": "Ozu",
    "type": "Hilltop",
    "condition": "Reconstructed main keep",
    "access": "Iyo Ozu Sta. (Yosan Line), taxi",
    "website": "http://www.city.ozu.ehime.jp/site/kanko/1223.html",
    "history": "The first fortifications on this site were constructed in 1331 by Utsunomiya Toyofusa. From 1585-1617 the castle was ruled by a quick succession of lords including Kobayakawa Takakage, Toda Katsutaka, Todo Takatora and Wakisaka Yasuharu. The castle you see today was most likely built up during this time. Kato Sadayasu arrived in 1617 and his descendents ruled until the Meiji Restoration. The main keep was destroyed in 1888. The reconstruction was completed in 2004 using wood and traditional methods. It also connects 2 of the original yagura."
  },
  {
    "stampnumber": "083",
    "nameen": "Uwajima Castle",
    "namejp": "宇和島城",
    "castlepic": "/images/castlepics/castle083.png",
    "stamppic": "/images/stamps/stamp083.png",
    "region": "Shikoku",
    "prefecture": "Ehime",
    "city": "Uwajima",
    "type": "Hilltop",
    "condition": "Original main keep",
    "access": "Uwajima Sta. (Yosan Line), 10 minutes walk.",
    "website": "http://www.city.uwajima.ehime.jp/site/uwajima-jo/",
    "history": "Todo Takatora built this castle after being granted the small fiefdom around it by Toyotomi Hideyoshi in 1595. After the battle of Sekigahara (1600), Todo Takatora moved to Imabari leaving it in the hands of Tomita Nobutaka. From 1615 until the Meiji Restoration Uwajima Castle was ruled by Date Hidemune and his descendents. The basic territory and layout of the castle did not change from the time of Takatora, but the Date completed the fortifications with yagura, gates and stone walls."
  },
  {
    "stampnumber": "084",
    "nameen": "Kochi Castle",
    "namejp": "高知城",
    "castlepic": "/images/castlepics/castle084.png",
    "stamppic": "/images/stamps/stamp084.png",
    "region": "Shikoku",
    "prefecture": "Kochi",
    "city": "Kōchi",
    "type": "Hilltop",
    "condition": "Original main keep",
    "access": "Kochi Station, 25 minute walk or 15 minutes bus or street car",
    "website": "http://www.city.kochi.kochi.jp/deeps/15/1503/guide/guide.htm",
    "history": "Yamanouchi Kazutoyo began the construction of Kochi castle in 1601 after he was stationed in the Tosa region. Originally he resided in Urado Castle but decided to build a new castle in the current location. Yamanouchi moved in two years later after the main keep and main structures were finished. The whole castle was completed in 1611.\n\nMuch of the castle, including the main keep, were burned to the ground in a great fire that broke out in the castle town in 1727. The current main keep dates from this reconstruction which was completed in 1748. It took until 1753 until the castle was completely rebuilt.\n\nOne of the most rare aspects of this castle is that all the structures from the original honmaru remain."
  },
  {
    "stampnumber": "085",
    "nameen": "Fukuoka Castle",
    "namejp": "福岡城",
    "castlepic": "/images/castlepics/castle085.png",
    "stamppic": "/images/stamps/stamp085.png",
    "region": "Kyushu",
    "prefecture": "Fukuoka",
    "city": "Fukuoka",
    "type": "Hilltop",
    "condition": "No main keep but other buildings",
    "access": "Hakata Sta. (Kagoshima Line)",
    "website": "http://www.city.fukuoka.jp/contents/7d14c212173a/7d14c212173a66.htm",
    "history": "Kuroda Nagamasa received lands around present day Fukuoka for his service in the Battle of Sekigahara. Nagamasa came to Fukuoka in 1601 and began building Fukuoka Castle. In its time, Fukuoka Castle was the largest castle in Kyushu and boasted 47 yagura. Even though there is a foundation for a main keep, there is no evidence that a main keep was ever built. Noguchi Kazushige, who also assisted with Osaka and Edo Castles, built the stone walls of the castle. It is said Kato Kiyomasa was so impressed with the scale and workmanship, he nicknamed it the Stone Castle (Seki-jo).\n\nThe Kuroda family ruled for 12 generations and over 270 years. In 1871, the castle was decommissioned and most of the buildings were disassembled or moved."
  },
  {
    "stampnumber": "086",
    "nameen": "Ono Castle",
    "namejp": "大野城",
    "castlepic": "/images/castlepics/castle086.png",
    "stamppic": "/images/stamps/stamp086.png",
    "region": "Kyushu",
    "prefecture": "Fukuoka",
    "city": "Ono",
    "type": "Mountaintop",
    "condition": "Ruins only",
    "access": "By car: there is car parking at Shiouji-kenmin-no-mori. There is also a community bus from Daizaifu station, or Nishitetsu bus from Fukuoka Station.",
    "website": "http://www.city.onojo.fukuoka.jp/edu/rekishi/iseki/onojoato.html",
    "history": "Ono castle is considered Japan's oldest castle. It was built to defend the cultural-political centre of Daizaifu, and provide refuge if Daizaifu fell under attack. According to the `Chronicles of Japan,` (Nihon Shoki), in the year 660, the Baekje (Kudara) kingdom on the Korean peninsula was besieged by the Tang-Silla alliance, and requested a relief force from the Yamato court in Japan. Crown Prince Naka no Ōe, later to become Emperor Tenji, and Empress Saimei ordered the dispatch of troops and ships, who ultimately sustained heavy casualties at the Battle of Baekgang in 663. Suffering from critical losses, and fearing retribution or invasion from the victorious Tang-Silla alliance, the Yamato court ordered the creation of Ono castle. This involved fortifying some eight kilometres of mountaintop and constructing and provisioning over 70 storehouses within the defenses. Other shore-based defenses and island-based signal towers were also constructed around this time, although the expected attack never came."
  },
  {
    "stampnumber": "087",
    "nameen": "Hizen Nagoya Castle",
    "namejp": "肥前名護屋城",
    "castlepic": "/images/castlepics/castle087.png",
    "stamppic": "/images/stamps/stamp087.png",
    "region": "Kyushu",
    "prefecture": "Saga",
    "city": "Karatsu",
    "type": "Hilltop",
    "condition": "Ruins only",
    "access": "Karatsu Sta., Showa Bus 40 mins",
    "website": "http://www.pref.saga.lg.jp/web/nagoya.html",
    "history": "After completing the unification of Japan, Toyotomi Hideyoshi set his sights on the Korean Peninsula. He built Nagoya Castle on one of the nearest possible points to Korea from which to launch troops. Nagoya was a large castle with a five story main keep. Lords from all over Kyushu, including Kato Kiyomasa, were charged with it's construction and amazingly completed most of the major sections in only seven months. Outside the castle were also many bases of other lords from throughout Japan who gathered to participate in these campaigns. After Hideyoshi's death, the castle was dismantled and parts we red were used to build Karatsu Castle. The Otemon Gate was also moved to Date Masamune's Sendai Castle."
  },
  {
    "stampnumber": "088",
    "nameen": "Yoshinogari Site",
    "namejp": "吉野ヶ里",
    "castlepic": "/images/castlepics/castle088.png",
    "stamppic": "/images/stamps/stamp088.png",
    "region": "Kyushu",
    "prefecture": "Saga",
    "city": "Yoshinogari",
    "type": "Flatland",
    "condition": "No main keep but other buildings",
    "access": "Kanzaki or Yoshinogari Koen Stations (Nagasaki Line), 15 min walk",
    "website": "http://www.yoshinogari.jp/en/contents2/",
    "history": "The Yoshinogari settlement is one of the earliest fortification types found in Japan. As populations began to swell and people fought for resources and arable land, they also began to fortify their villages with moats. Artifacts found at the Yoshinogari site can be dated to various times in the Yayoi Period showing that it flourished throughout. Yoshinogari is particularly important because of it's incredibly vast size. It's size and location have led some researchers to theorize that it was the capital of the Yamatai country as noted in some ancient Chinese texts, but there is no proof linking them together. It was long known that some important relics could be found in this area but serious excavations did not begin until 1986."
  },
  {
    "stampnumber": "089",
    "nameen": "Saga Castle",
    "namejp": "佐賀城",
    "castlepic": "/images/castlepics/castle089.png",
    "stamppic": "/images/stamps/stamp089.png",
    "region": "Kyushu",
    "prefecture": "Saga",
    "city": "Saga",
    "type": "Flatland",
    "condition": "No main keep but other buildings",
    "access": "Saga Sta. (Nagasaki Line); 10 min bus.",
    "website": "http://sagajou.jp/english/guide.html",
    "history": "In 1608 Nabeshima Naoshige and his son Katsushige built Saga Castle from by expanding on and utilizing much of the former Muranaka Castle which belonged to the Sengoku period lords of the Ryuzoji clan. Saga Castle was plagued by fires. Between 1716-1736 most of the castle buildings including the main keep burned down. The main keep was never rebuilt but the palace and government buildings were rebuilt centering on the Ninomaru compound. In 1835 the Ninomaru Palace among other buildings burned down so they moved back to the Honmaru compound where a new palace was constructed. The extant Shachinomon gate and connected yagura date from this time period (1838) and the reconstructed palace also reflects the Honmaru palace from this period.\n\nMuch of the castle also burned down during the Saga Rebellion of 1874. The Honmaru Palace actually survived through the Meiji Period and was used as government offices and a school until it was dismantled in 1957."
  },
  {
    "stampnumber": "090",
    "nameen": "Hirado Castle",
    "namejp": "平戸城",
    "castlepic": "/images/castlepics/castle090.png",
    "stamppic": "/images/stamps/stamp090.png",
    "region": "Kyushu",
    "prefecture": "Nagasaki",
    "city": "Hirado",
    "type": "Hilltop",
    "condition": "Reconstructed main keep",
    "access": "Tabira Hiradoguchi Sta (Matsuura Rail), bus",
    "website": "http://www.city.hirado.nagasaki.jp/english/sights/traditionaldetails.html",
    "history": "The first castle was built in 1599 by Matsuura Shigenobu. The Matsuura clan burned down the castle in 1613 to show their loyalty to the Tokugawa shogunate. Construction on the present day castle was begun in 1704 and completed in 1718. The castle was designed by military strategist Yamaga Soko making use of the natural features of the land to increase the defensive ability of the castle. The Matsuura continued to rule from Hirado until the Meiji Restoration. The main keep and four yagura were reconstructed in 1962."
  },
  {
    "stampnumber": "091",
    "nameen": "Shimabara Castle",
    "namejp": "島原城",
    "castlepic": "/images/castlepics/castle091.png",
    "stamppic": "/images/stamps/stamp091.png",
    "region": "Kyushu",
    "prefecture": "Nagasaki",
    "city": "Shimabara",
    "type": "Flatland",
    "condition": "Reconstructed main keep",
    "access": "Shimabara Sta. (Shimabara Line); 10 min, walk",
    "website": "http://www.shimabarajou.jp/index.cgi",
    "history": "The Arima clan, who were Christian lords, ruled over the Southern part of the Shimabara Peninsula from Hinoe Castle and Hara Castle. The Tokugawa had originally been tolerant of Christianity but from 1614 they changed policy and expelled the missionaries. At this time, the lord of Shimabara, Arima Naozumi, was also relocated and Matsukura Shigemasa took his place. Matsukura strictly enforced the prohibition against Christianity.\n\nInstead of making use of the Arima's castles, Matsukura began construction of the new Shimabara Castle and heavily taxed the peasants to pay for it. This oppression of the peasants is what led to the Shimabara Rebellion in the winter of 1637-1638. In an interesting twist of events, the rebels made use of Hara Castle which had simply been abandoned years earlier by Matsukura. The buildings were gone but the moats and walls remained so with little effort the rebels had a fully defensible stronghold.\n\nShimabara Castle had several different ruling families until the Meiji Period when it was dissassembled."
  },
  {
    "stampnumber": "092",
    "nameen": "Kumamoto Castle",
    "namejp": "熊本城",
    "castlepic": "/images/castlepics/castle092.png",
    "stamppic": "/images/stamps/stamp092.png",
    "region": "Kyushu",
    "prefecture": "Kumamoto",
    "city": "Kumamoto",
    "type": "Hilltop",
    "condition": "Reconstructed main keep",
    "access": "Kumamoto Sta. (Kagoshima Line), city bus",
    "website": "https://castle.kumamoto-guide.jp/en/",
    "history": "After the battle of Sekigahara, Kato Kiyomasa built this incredible fortress in Kumamoto. The castle expertly utilizes the geography to make one of the most impregnable castles ever built in Japan.\nThe Kato reign ended after only two generations when Kiyomasa's son was replaced by Hosokawa Tadatoshi in 1632. The Hosokawa reigned for 240 years until the Meiji Period.\n\nThe main keep and connected smaller tower, among other buildings, were burned to the ground during the Satsuma rebellion of 1877."
  },
  {
    "stampnumber": "093",
    "nameen": "Hitoyoshi Castle",
    "namejp": "人吉城",
    "castlepic": "/images/castlepics/castle093.png",
    "stamppic": "/images/stamps/stamp093.png",
    "region": "Kyushu",
    "prefecture": "Kumamoto",
    "city": "Hitoyoshi",
    "type": "Hilltop",
    "condition": "No main keep but other buildings",
    "access": "Hitoyoshi Sta. (Hisatsu Line); 10 min walk",
    "website": "http://www.city.hitoyoshi.lg.jp/q/aview/186/1341.html",
    "history": "The original Hitoyoshi Castle was founded by Sagara Nagayori in 1198. From this time, the Sagara made Hitoyoshi their home for 35 generations. The first evidence of a Sengoku Period castle appears in 1470 when Sagara Tametsugu was lord. In 1589 Sagara Nagatsune began a large scale renovation of the castle. The baileys and main structures were completed in 1601 and the stone walls were completed in 1644. An interesting feature of this castle is that it made use of the Kumagawa River as the outer moat and built in many boat landings to increase water traffic and trade. The castle was dismantled in 1872 and only the stone walls remain. Recent reconstruction efforts have rebuilt two yagura and a gate."
  },
  {
    "stampnumber": "094",
    "nameen": "Funai Castle",
    "namejp": "府内城",
    "castlepic": "/images/castlepics/castle094.png",
    "stamppic": "/images/stamps/stamp094.png",
    "region": "Kyushu",
    "prefecture": "Oita",
    "city": "Oita",
    "type": "Flatland",
    "condition": "No main keep but other buildings",
    "access": "JR Oita Station (Nippo Line); 10 min walk",
    "website": "http://www.visit-oita.jp/feature/2011autumn/funai.html",
    "history": "Fukuhara Naotaka moved from Usuki and started building the castle in 1597. The castle was completed 2 years later. Fukuhara was sent back to Usuki and replaced by Hayakawa Nagamasa. Hayakawa joined the losing side of the Battle of Sekigahara and committed seppuku. The new lord Takenaka Shigetoshi started renovating much of the castle and built the main keep in 1602. Shigetoshi's son Shigeyoshi committed seppuku in 1634 for his part in a scandal while he was the Nagasaki Bugyo (governor of the port of Nagasaki). He was replaced by Hineno Yoshiaki. Yoshiaki died in 1656 and from that point, Funai Castle was ruled by the Matsudaira, starting with Matsudaira Tadaaki."
  },
  {
    "stampnumber": "095",
    "nameen": "Oka Castle",
    "namejp": "岡城 ",
    "castlepic": "/images/castlepics/castle095.png",
    "stamppic": "/images/stamps/stamp095.png",
    "region": "Kyushu",
    "prefecture": "Oita",
    "city": "Taketa",
    "type": "Mountaintop",
    "condition": "Ruins only",
    "access": "Bungo Taketa Sta. (Houhi Line); taxi",
    "website": "http://www2.city.taketa.oita.jp/kanko/konomichi/index.html",
    "history": "Oka Castle has a very long history. It was originally founded for Minamoto no Yoshitsune in 1185. Shiga Sadatomo entered the castle in 1332 and initiated many repairs and improvements. Shiga's descendents ruled Oka Castle until 1586. Nakagawa Hideshige took over the castle in 1594 and began more improvements and expansion of the castle, including building a main keep and palace. The main keep was destroyed in an earthquake during the Edo Period. The Nakagawa ruled until the Meiji Restoration when all the buildings were dismantled leaving only some of the stone walls we see today."
  },
  {
    "stampnumber": "096",
    "nameen": "Obi Castle",
    "namejp": "飫肥城",
    "castlepic": "/images/castlepics/castle096.png",
    "stamppic": "/images/stamps/stamp096.png",
    "region": "Kyushu",
    "prefecture": "Miyazaki",
    "city": "Nichinan",
    "type": "Hilltop",
    "condition": "No main keep but other buildings",
    "access": "Obi Sta. (Nichinan Line), 15 min walk",
    "website": "http://www.miyazaki-cci.or.jp/nichinan/obijyou.html",
    "history": "The first castle on this site was founded by the Tsuchimochi clan during the Nanboku-cho Period, but it mostly comes into history from the mid 1400's. The Shimazu fortified this castle to prevent expansion into Obi by the Ito clan. It became a focal point of conflict between the Ito and Shimazu, but the Ito only managed to win it once in 1567. It was taken back by the Shimazu in 1572 and remained in their control until Hideyoshi's Kyushu campaigns in 1587. The Ito Clan, one of the first allies of Hideyoshi, were awarded Obi for their loyalty. The Ito started the development of the castle town. In 1686, Ito Sukezane began a major overhaul of the castle to fortify it against earthquakes and to rebuild it into a modern castle. The Ito Clan continued to rule until the Meiji Period."
  },
  {
    "stampnumber": "097",
    "nameen": "Kagoshima Castle",
    "namejp": "鹿児島城",
    "castlepic": "/images/castlepics/castle097.png",
    "stamppic": "/images/stamps/stamp097.png",
    "region": "Kyushu",
    "prefecture": "Kagoshima",
    "city": "Kagoshima",
    "type": "Flatland",
    "condition": "Ruins only",
    "access": "Kagoshima Sta. (Nippo Line), 15min walk",
    "website": "http://www.city.kagoshima.lg.jp/1010/kanko/database/category/rekishi/history/28020.html",
    "history": "Started in 1601, it took 10 years to complete Kagoshima Castle. The layout is very simple with only the honmaru and ninomaru baileys at the foot of the mountain. The castle had only only gate with a palace and government offices, but no yagura or main keep. The simple design and few structures is likely due to a lack of funds and from a disagreement between Iehisa and his father, who was against building the castle, over how to spend limited resources. 12 generations of the Shimazu ruled over Kagoshima castle until it was decommissioned in 1873."
  },
  {
    "stampnumber": "098",
    "nameen": "Nakijin Castle",
    "namejp": "今帰仁城",
    "castlepic": "/images/castlepics/castle098.png",
    "stamppic": "/images/stamps/stamp098.png",
    "region": "Kyushu",
    "prefecture": "Okinawa",
    "city": "Nakijin",
    "type": "Mountaintop",
    "condition": "Ruins only",
    "access": "Bus or Rental Car",
    "website": "http://www.wonder-okinawa.jp/002/001/enaj.html",
    "history": "Nakijin castle is estimated to have been built in the 13th Century by the AJi lords. It was the home of the Aji until the Hanji took control in the 14th century and established the Hokuzan Kingdom whose base was Nakijin Castle. In 1416 the Chuzan Kingdom conquered the Hokuzan Kingdom and stationed their governor at Nakijin Castle. The governor, Lord Gosamaru, was said to have been a descendent of the Aji lords who originally built Nakijin Castle.\nNakijin Castle, along with Shuri Castle and several other related sites in Okinawa, were desiganted a UNESCO World Cultural Heritage site in 2000. They are also designated a National Historical Site."
  },
  {
    "stampnumber": "099",
    "nameen": "Nakagusuku Castle",
    "namejp": "中城城",
    "castlepic": "/images/castlepics/castle099.png",
    "stamppic": "/images/stamps/stamp099.png",
    "region": "Kyushu",
    "prefecture": "Okinawa",
    "city": "Kitanakagusuku",
    "type": "Mountaintop",
    "condition": "Ruins only",
    "access": "50 min by bus from Naha Bus Terminal; 5 min taxi",
    "website": "http://www.wonder-okinawa.jp/002/001/enak.html",
    "history": "Nakakgusuku Castle was built by Sakinakagusuku Aji in the mid 14th Century and expanded upon by Gosamaru in the early 15th Century. Gosamaru was moved to Nakagusuku by the king to check the rising power of Amawari Aji in Katsuren Castle. In 1458 the castle fell to attacks by Amawari the lord of Katsuren Castle. The castle is made up of 6 baileys, each of a different elevation. It is said that Commodore Perry was impressed by the strength of the castle and the engineering displayed in its construction."
  },
  {
    "stampnumber": "100",
    "nameen": "Shuri Castle",
    "namejp": "首里城",
    "castlepic": "/images/castlepics/castle100.png",
    "stamppic": "/images/stamps/stamp100.png",
    "region": "Kyushu",
    "prefecture": "Okinawa",
    "city": "Naha",
    "type": "Hilltop",
    "condition": "Reconstructed main keep",
    "access": "Bus",
    "website": "http://www.shurijo.com/",
    "history": "The castle was originally founded somewhere in the 13-14th centuries. It was modified and expanded several times coming into its hieght of power during as a palace and fortress for the Ryukyu kings who established the unified Ryukyu kingdom in 1429. These kings ruled for abour 400 years until the Meiji government ousted the king in 1879 and established the prefecture of Okinawa. From 1609 the kingdom was under the control of the Satsuma clan and thereby the Tokugawa Shogunate but they kept some freedom regarding their relationships with China.\n\nObviously Shuri Castle was neither influenced by the same factors as typical mainland castles nor does it have many of the same structures or types of architecture. The castle and other related sites in the area were designated a UNESCO World Heritage site in 2000."
  }
]
